/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: sfxgamempcontent_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function sfxgamempcontent.sfxgawreinforcementmanager.CanAffordNewStoreItems
// [0x00020002] 
struct Usfxgawreinforcementmanager_execCanAffordNewStoreItems_Parms
{
	int                                                OldCredits;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NewCredits;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetPCPointsBalance
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetPCPointsBalance_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetOfferIDFromStoreID
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetOfferIDFromStoreID_Parms
{
	int                                                StoreID;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nStoreItemIndex;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetStoreItemIDFromOffer
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetStoreItemIDFromOffer_Parms
{
	int                                                offerId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nStoreItemIndex;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_Finished
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_Finished_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ExitConsumptionFlow
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execExitConsumptionFlow_Parms
{
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.FinishPurchase
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execFinishPurchase_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.AwardPacks
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execAwardPacks_Parms
{
	int                                                nID;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nCopies;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             nConsumableMapIndex;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.UpdateLastAwardedCards
// [0x00840003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execUpdateLastAwardedCards_Parms
{
	// struct FCardInfoData                            Card;                                             		// 0x0000 (0x0068) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_SaveComplete
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_SaveComplete_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_ProcessRemote
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_ProcessRemote_Parms
{
	// int                                             nID;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             nCopies;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GrantPackPurchasedEntitlement
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGrantPackPurchasedEntitlement_Parms
{
	// unsigned long                                   bOwnEntitlement : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// TArray< struct FBWEntitlementInfo >             aEntitlements;                                    		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FBWEntitlementInfo                       eEntitlement;                                     		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_ProcessLocal
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_ProcessLocal_Parms
{
	struct FBWConsumableId                             Id;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nCopies;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nResult;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             NextConsumableToProcess;                          		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             NumCopiesToConsume;                               		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_Top
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_Top_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FBWConsumableId                          Id;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.StartConsumptionFlow
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execStartConsumptionFlow_Parms
{
	unsigned long                                      bRefreshSave : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_Setup
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_Setup_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ProcessConsumables
// [0x00024003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execProcessConsumables_Parms
{
	struct FScriptDelegate                             ConsumeCallback;                                  		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bRetry : 1;                                       		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_ClearCallbackTimer
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_ClearCallbackTimer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXGRI*                                  GRI;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_SetCallbackTimer
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_SetCallbackTimer_Parms
{
	float                                              fTime;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXGRI*                                  GRI;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlow_Timer
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlow_Timer_Parms
{
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ConsumptionFlowError
// [0x00024003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execConsumptionFlowError_Parms
{
	struct FString                                     sMsg;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bAbortFlow : 1;                                   		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bWipeSave : 1;                                    		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.PurchaseItemFromPlatform
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execPurchaseItemFromPlatform_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             PurchaseCallback;                                 		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nItemIndex;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             nOfferIndex;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// TArray< struct FBWOfferInfo >                   Offers;                                           		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FBWOfferInfo                             Offer;                                            		// 0x0028 (0x0038) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.CanPurchaseItemWithCredits
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execCanPurchaseItemWithCredits_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             ItemIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             TotalCredits;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.ReloadPlayerSettingsComplete
// [0x00020002] 
struct Usfxgawreinforcementmanager_execReloadPlayerSettingsComplete_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// struct FString                                  refreshedBaseKey;                                 		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bBaseKeyWasSaved : 1;                             		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UOnlinePlayerStorage*                     PlayerStorage;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.OnPurchaseItemWithCreditsFinished
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execOnPurchaseItemWithCreditsFinished_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UOnlinePlayerStorage*                     PlayerStorage;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ULocalPlayer*                             LP;                                               		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.PurchaseItemWithCredits
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execPurchaseItemWithCredits_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             SaveRecordsCallback;                              		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class USFXSaveManagerMP*                        MPSaveManager;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             ItemIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.EntitlementVisiblityCheck
// [0x00440003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execEntitlementVisiblityCheck_Parms
{
	struct FVisibleCondition                           visible;                                          		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< struct FBWEntitlementInfo >                Entitlements;                                     		// 0x000C (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             Idx2;                                             		// 0x0020 (0x0004) [0x0000000000000000]              
	// int                                             IDToCheck;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bEntitlementFound : 1;                            		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bNeedsToExist : 1;                                		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.CheckOfferVisibility
// [0x00440003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execCheckOfferVisibility_Parms
{
	struct FStoreInfoEntry                             StoreItem;                                        		// 0x0000 (0x0080) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< struct FBWEntitlementInfo >                Entitlements;                                     		// 0x0080 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x008C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x0090 (0x0004) [0x0000000000000000]              
	// struct FVisibleCondition                        Condition;                                        		// 0x0094 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.FindOfferIndex
// [0x00440003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execFindOfferIndex_Parms
{
	int                                                nOfferID;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FBWOfferInfo >                      Offers;                                           		// 0x0004 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetStoreItemPurchaseType
// [0x00444003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetStoreItemPurchaseType_Parms
{
	struct FStoreInfoEntry                             StoreItem;                                        		// 0x0000 (0x0080) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     FirstPartyPrice;                                  		// 0x0080 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x008C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetPlatformCostValue
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetPlatformCostValue_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// TArray< struct FBWOfferInfo >                   Offers;                                           		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nItemIndex;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             nOfferIndex;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetPlatformCost
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetPlatformCost_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// TArray< struct FBWOfferInfo >                   Offers;                                           		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nItemIndex;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             nOfferIndex;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetCreditCost
// [0x00020002] 
struct Usfxgawreinforcementmanager_execGetCreditCost_Parms
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nItemIndex;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.StoreItemSort
// [0x00120002] 
struct Usfxgawreinforcementmanager_execStoreItemSort_Parms
{
	struct FStoreGUIData                               Entry_A;                                          		// 0x0000 (0x0058) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FStoreGUIData                               Entry_B;                                          		// 0x0058 (0x0058) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x00B0 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetStoreItems
// [0x00820003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetStoreItems_Parms
{
	TArray< struct FStoreGUIData >                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// TArray< struct FStoreGUIData >                  StoreData;                                        		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FStoreGUIData                            NewItem;                                          		// 0x0018 (0x0058) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x0070 (0x0004) [0x0000000000000000]              
	// int                                             nOfferIndex;                                      		// 0x0074 (0x0004) [0x0000000000000000]              
	// int                                             nCurrentTime;                                     		// 0x0078 (0x0004) [0x0000000000000000]              
	// struct FStoreInfoEntry                          CurrStoreItem;                                    		// 0x007C (0x0080) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< struct FBWOfferInfo >                   Offers;                                           		// 0x00FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< struct FBWEntitlementInfo >             Entitlements;                                     		// 0x0108 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class USFXEngine*                               Engine;                                           		// 0x0114 (0x0004) [0x0000000000000000]              
	// struct FBWConsumableInfo                        i;                                                		// 0x0118 (0x0008) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetStoreInfo
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetStoreInfo_Parms
{
	TArray< struct FStoreInfoEntry >                   ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.IsFetchingProductDetails
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execIsFetchingProductDetails_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetProductDetailsComplete
// [0x00040003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetProductDetailsComplete_Parms
{
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.UpdateStoreDescriptions
// [0x00820003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execUpdateStoreDescriptions_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FStoreInfoEntry                          CurrStoreItem;                                    		// 0x0008 (0x0080) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FBWOfferId                               Offer;                                            		// 0x0088 (0x0004) [0x0000000000000000]              
	// TArray< struct FBWOfferId >                     Offers;                                           		// 0x008C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.MatchConsumableSort
// [0x00120002] 
struct Usfxgawreinforcementmanager_execMatchConsumableSort_Parms
{
	struct FCardInfoData                               ItemA;                                            		// 0x0000 (0x0068) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FCardInfoData                               ItemB;                                            		// 0x0068 (0x0068) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x00D0 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FString                                  A;                                                		// 0x00D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FString                                  B;                                                		// 0x00E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetUniqueMatchConsumables
// [0x00820003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetUniqueMatchConsumables_Parms
{
	class Usfxgawreinforcementmatchconsumable*         ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             Idx2;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
	// class Usfxgawreinforcementmatchconsumable*      SuperCard;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bAlreadyInList : 1;                               		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             CardID;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             CardVersion;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FCardInfoData                            CardInfo;                                         		// 0x001C (0x0068) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GiveCardPack
// [0x00024003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGiveCardPack_Parms
{
	struct FString                                     PackName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nConsumableId;                                    		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	TArray< struct FCardInfoData >                     ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x001C (0x0004) [0x0000000000000000]              
	// int                                             Idx2;                                             		// 0x0020 (0x0004) [0x0000000000000000]              
	// int                                             Idx3;                                             		// 0x0024 (0x0004) [0x0000000000000000]              
	// int                                             ExpectedCardCount;                                		// 0x0028 (0x0004) [0x0000000000000000]              
	// int                                             PackCount;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	// TArray< struct FCardInfoData >                  CardPack;                                         		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundPack : 1;                                   		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	// class USFXEngine*                               Engine;                                           		// 0x0040 (0x0004) [0x0000000000000000]              
	// class USFXSaveManagerMP*                        MPSaveManager;                                    		// 0x0044 (0x0004) [0x0000000000000000]              
	// class ABioWorldInfo*                            WI;                                               		// 0x0048 (0x0004) [0x0000000000000000]              
	// unsigned long                                   InLobby : 1;                                      		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             PacksBought;                                      		// 0x0050 (0x0004) [0x0000000000000000]              
	// int                                             StoreInfoIdx;                                     		// 0x0054 (0x0004) [0x0000000000000000]              
	// float                                           TotalWeight;                                      		// 0x0058 (0x0004) [0x0000000000000000]              
	// float                                           RandWeight;                                       		// 0x005C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.AwardRandomCardsFromPoolCards
// [0x00C24003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execAwardRandomCardsFromPoolCards_Parms
{
	struct FString                                     PoolName;                                         		// 0x0000 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     ChosenCards;                                      		// 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                Quantity;                                         		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      AllowDupes : 1;                                   		// 0x001C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x0024 (0x0004) [0x0000000000000000]              
	// TArray< class USFXGAWReinforcementBase* >       PoolCards;                                        		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FCardInfoData                            Card;                                             		// 0x0034 (0x0068) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             NumAwardedCards;                                  		// 0x009C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.PopulateCardData
// [0x00420003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execPopulateCardData_Parms
{
	struct FCardInfoData                               Card;                                             		// 0x0000 (0x0068) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0068 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             idx;                                              		// 0x006C (0x0004) [0x0000000000000000]              
	// int                                             IncrementBonus;                                   		// 0x0070 (0x0004) [0x0000000000000000]              
	// int                                             Version;                                          		// 0x0074 (0x0004) [0x0000000000000000]              
	// unsigned char                                   Rarity;                                           		// 0x0078 (0x0001) [0x0000000000000000]              
	// int                                             UniqueId;                                         		// 0x007C (0x0004) [0x0000000000000000]              
	// void*                                           GUIName;                                          		// 0x0080 (0x0004) [0x0000000000000000]              
	// void*                                           GUIDesc;                                          		// 0x0084 (0x0004) [0x0000000000000000]              
	// int                                             MaxCount;                                         		// 0x0088 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.GetCardsOfType
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execGetCardsOfType_Parms
{
	struct FString                                     PoolName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< class USFXGAWReinforcementBase* >          ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// TArray< class USFXGAWReinforcementBase* >       PoolCards;                                        		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x0024 (0x0004) [0x0000000000000000]              
	// int                                             Idx2;                                             		// 0x0028 (0x0004) [0x0000000000000000]              
	// int                                             DeckCount;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	// int                                             SubCardCount;                                     		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.CardSort
// [0x00120002] 
struct Usfxgawreinforcementmanager_execCardSort_Parms
{
	class USFXGAWReinforcementBase*                    CardA;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USFXGAWReinforcementBase*                    CardB;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.LoadDeck
// [0x00020003] ( FUNC_Final )
struct Usfxgawreinforcementmanager_execLoadDeck_Parms
{
	// TArray< class UObject* >                        ObjectCards;                                      		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class UObject*                                  ObjectCard;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXEngine*                               Engine;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// class USFXGAWReinforcementBase*                 Card;                                             		// 0x0014 (0x0004) [0x0000000000000000]              
	// class Usfxgawreinforcementmatchconsumable*      MatchConsumable;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.OnPurchaseItemWithCreditsDelegate
// [0x00120000] 
struct Usfxgawreinforcementmanager_execOnPurchaseItemWithCreditsDelegate_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.OnProcessConsumablesDelegate
// [0x00120000] 
struct Usfxgawreinforcementmanager_execOnProcessConsumablesDelegate_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmanager.OnPurchaseItemDelegate
// [0x00120000] 
struct Usfxgawreinforcementmanager_execOnPurchaseItemDelegate_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.ConsumeNonGameplayConsumable
// [0x00022002] 
struct USFXGAWReinforcementBase_execConsumeNonGameplayConsumable_Parms
{
	struct FName                                       UniqueName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                VersionIdx;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class USFXEngine*                               Engine;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             CurrentValue;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FName                                    ConsumableCountPV;                                		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GenerateCardUniqueID
// [0x00020002] 
struct USFXGAWReinforcementBase_execGenerateCardUniqueID_Parms
{
	int                                                idx;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GetCardUniqueID
// [0x00020002] 
struct USFXGAWReinforcementBase_execGetCardUniqueID_Parms
{
	int                                                idx;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GetPlayerVariableNameFromCard
// [0x00420002] 
struct USFXGAWReinforcementBase_execGetPlayerVariableNameFromCard_Parms
{
	struct FCardInfoData                               Card;                                             		// 0x0000 (0x0068) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FName                                       ReturnValue;                                      		// 0x0068 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GetPlayerVariableName
// [0x00020002] 
struct USFXGAWReinforcementBase_execGetPlayerVariableName_Parms
{
	int                                                idx;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GetCurrentCount
// [0x00024002] 
struct USFXGAWReinforcementBase_execGetCurrentCount_Parms
{
	int                                                SearchUniqueID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             currentCount;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             CardListCount;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	// class USFXEngine*                               Engine;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.OnAwarded
// [0x00424002] 
struct USFXGAWReinforcementBase_execOnAwarded_Parms
{
	struct FCardInfoData                               CardInfoOut;                                      		// 0x0000 (0x0068) [0x0000000000400190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     ChosenCards;                                      		// 0x0068 (0x000C) [0x0000000000400192]              ( CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0074 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             CurrentValue;                                     		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x007C (0x0004) [0x0000000000000000]              
	// TArray< struct FCardInfoData >                  SubCardPool;                                      		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bCardFound : 1;                                   		// 0x008C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FBWEntitlementId                         eID;                                              		// 0x0090 (0x0004) [0x0000000000000000]              
	// struct FName                                    PlayerVariable;                                   		// 0x0094 (0x0008) [0x0000000000000000]              
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.SetCurrentValue
// [0x00020002] 
struct USFXGAWReinforcementBase_execSetCurrentValue_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Value;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.GetCurrentValue
// [0x00020002] 
struct USFXGAWReinforcementBase_execGetCurrentValue_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.Initialize
// [0x00020002] 
struct USFXGAWReinforcementBase_execInitialize_Parms
{
	// int                                             idx;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.IsActive
// [0x00020002] 
struct USFXGAWReinforcementBase_execIsActive_Parms
{
	int                                                UniqueId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.Deactivate
// [0x00020000] 
struct USFXGAWReinforcementBase_execDeactivate_Parms
{
	int                                                UniqueId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.SFXGAWReinforcementBase.Activate
// [0x00020000] 
struct USFXGAWReinforcementBase_execActivate_Parms
{
	int                                                UniqueId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.TrimTrailingZeroes_NoGear
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execTrimTrailingZeroes_NoGear_Parms
{
	struct FString                                     S;                                                		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      KeepDecimal : 1;                                  		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             pos;                                              		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.FloatToString_NoGear
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execFloatToString_NoGear_Parms
{
	float                                              F;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.FloatToPercentString_NoGear
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execFloatToPercentString_NoGear_Parms
{
	float                                              F;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.FindDescriptionTokens_NoGear
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execFindDescriptionTokens_NoGear_Parms
{
	struct FString                                     CardUniqueName;                                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FDescriptionTokens                          ReturnValue;                                      		// 0x000C (0x0034) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FDescriptionTokens                       InvalidTokens;                                    		// 0x0040 (0x0034) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x0074 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.PrepareCustomTokensForDescription
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execPrepareCustomTokensForDescription_Parms
{
	struct FString                                     CardUniqueName;                                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// struct FDescriptionTokens                       Tokens;                                           		// 0x000C (0x0034) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.OnAwarded
// [0x00424002] 
struct Usfxgawreinforcementmatchconsumable_execOnAwarded_Parms
{
	struct FCardInfoData                               CardInfoOut;                                      		// 0x0000 (0x0068) [0x0000000000400190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     ChosenCards;                                      		// 0x0068 (0x000C) [0x0000000000400192]              ( CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0074 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               Engine;                                           		// 0x0078 (0x0004) [0x0000000000000000]              
	// struct FName                                    PlayerVariable;                                   		// 0x007C (0x0008) [0x0000000000000000]              
	// int                                             CurrentValue;                                     		// 0x0084 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.GetPlayerVariableNameFromCard
// [0x00420002] 
struct Usfxgawreinforcementmatchconsumable_execGetPlayerVariableNameFromCard_Parms
{
	struct FCardInfoData                               Card;                                             		// 0x0000 (0x0068) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FName                                       ReturnValue;                                      		// 0x0068 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    PlayerVariableName;                               		// 0x0070 (0x0008) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.GetPlayerVariableName
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execGetPlayerVariableName_Parms
{
	int                                                idx;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    PlayerVariableName;                               		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.GetSlotTypeForCategory
// [0x00022002] 
struct Usfxgawreinforcementmatchconsumable_execGetSlotTypeForCategory_Parms
{
	int                                                Category;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.Deactivate
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execDeactivate_Parms
{
	int                                                UniqueId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// class Asfxpri*                                  PRI;                                              		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxgawreinforcementmatchconsumable.Activate
// [0x00020002] 
struct Usfxgawreinforcementmatchconsumable_execActivate_Parms
{
	int                                                UniqueId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              VersionIdx;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
