/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFXGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_BIO2DA_INDEX_ERROR                                 -1
#define CONST_AI_NearMissDistance                                200
#define CONST_AI_FlinchDistance                                  35.0f
#define CONST_AI_NearbyHurtDistance                              500
#define CONST_TIMER_ADJUSTTOSLOT_LIMIT                           5.f
#define CONST_MAXSEARCHPATHLENGTH                                2000.0f
#define CONST_BIO_ACTION_ANIM_NODE_COUNT                         11
#define CONST_SHOTS_PER_LOOP_CYCLE                               5.0f

	SFXPersOpt_Arm                                     = 5,
	SFXPersOpt_Leg                                     = 6,
	SFXPersOpt_Spec                                    = 7,
	SFXPersOpt_Pattern                                 = 8,
	SFXPersOpt_PatternColor                            = 9,
	SFXPersOpt_Tint1                                   = 10,
	SFXPersOpt_Tint2                                   = 11,
	SFXPersOpt_Emissive                                = 12,
	SFXPersOpt_MAX                                     = 13
};*/

// Enum SFXGame.SFXSFHandler_PowerWheel.SFXPowerWheelMode
/*enum SFXPowerWheelMode
{
	PWM_NONE                                           = 0,
	PWM_Powers                                         = 1,
	PWM_Weapons                                        = 2,
	PWM_PC                                             = 3,
	PWM_MAX                                            = 4
};*/

// Enum SFXGame.SFXSFHandler_PowerWheel.SFXPowerWheelPawnID
/*enum SFXPowerWheelPawnID
{
	PWPID_Player                                       = 0,
	PWPID_Hench1                                       = 1,
	PWPID_Hench2                                       = 2,
	PWPID_MAX                                          = 3
};*/

// Enum SFXGame.SFXSFHandler_PowerWheel.SFXPowerWheelWeaponState
/*enum SFXPowerWheelWeaponState
{
	PWWS_Normal                                        = 0,
	PWWS_Hover                                         = 1,
	PWWS_Disabled                                      = 2,
	PWWS_Selected                                      = 3,
	PWWS_WEAPSTATE_COUNT                               = 4,
	PWWS_MAX                                           = 5
};*/

// Enum SFXGame.SFXSystem.EBioReaperControlConditionPlotAutoSet
/*enum EBioReaperControlConditionPlotAutoSet
{
	BioReaperControlConditionPlot_Unset                = 0,
	BioReaperControlConditionPlot_MAX                  = 1
};*/

// Enum SFXGame.SFXSystem.EBioReaperControlConditionAutoSet
/*enum EBioReaperControlConditionAutoSet
{
	BioReaperControlCondition_Unset                    = 0,
	BioReaperControlCondition_MAX                      = 1
};*/

// Enum SFXGame.SFXTeamInfo.ESFXTeam
/*enum ESFXTeam
{
	TEAM_PLAYER                                        = 0,
	TEAM_ENEMY                                         = 1,
	TEAM_DUMMY                                         = 2,
	TEAM_EVERYONE                                      = 3,
	TEAM_MAX                                           = 4
};*/

// Enum SFXGame.SFXTracer.ESFXTracerState
/*enum ESFXTracerState
{
	eSFXTracerState_Idle                               = 0,
	eSFXTracerState_ScaleUp                            = 1,
	eSFXTracerState_ScaleDown                          = 2,
	eSFXTracerState_MAX                                = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGame.BioHardLinks
// 0x000C (0x0048 - 0x003C)
class UBioHardLinks : public UObject
{
public:
	TArray< struct FBioHardLinkReference >             References;                                       		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1350 ];

		return pClassPointer;
	};

};

UClass* UBioHardLinks::pClassPointer = NULL;

// Class SFXGame.BioHintSystemBase
// 0x008C (0x00C8 - 0x003C)
class UBioHintSystemBase : public UObject
{
public:
	TArray< struct FHintDefinition >                   m_aHints;                                         		// 0x003C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FSFXNotification >                  m_aNotifications;                                 		// 0x0048 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< int >                                      m_aCurrentlyDisplayedMiniNotificationIDs;         		// 0x0054 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FSFXNotificationData >              m_NotificationData;                               		// 0x0060 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x3C ];                            		// 0x006C (0x003C) UNKNOWN PROPERTY: MapProperty SFXGame.BioHintSystemBase.m_mTrackingData
	float                                              m_fMinimumTimeBetweenAnyHints;                    		// 0x00A8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fCurrentTime;                                   		// 0x00AC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nCurrentlyDisplayedHint;                        		// 0x00B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nCurrentlyDisplayedNotificationID;              		// 0x00B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UTexture2D*                                  m_DefaultImage;                                   		// 0x00B8 (0x0004) [0x0000000000000000]              
	float                                              m_fTimeSinceDisplayPossible;                      		// 0x00BC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              m_fDisplayDelay;                                  		// 0x00C0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bEnabled : 1;                                   		// 0x00C4 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      m_bDisabledForTutorial : 1;                       		// 0x00C4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bNotificationIsPaused : 1;                      		// 0x00C4 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1351 ];

		return pClassPointer;
	};

	void eventCacheCurrentState ( );
	void Tick ( float TimeDelta );
	float TimeSince ( float fTime );
	float GetPreviousTime ( int nAge, struct FHintTrackingData* oData );
	struct FHintTrackingData GetTrackingData ( struct FName nmEvent, struct FName nmContext );
	void Clear ( );
	void HintEvent ( struct FName nmEvent, struct FName nmContext );
	void ClearNotifications ( );
	void OnNotificationDisplayCompleted ( int nNotificationID );
	bool IsHintsOptionDisabled ( );
	bool HintsEnabled ( );
	void SetNotificationPaused ( unsigned long bVal );
	void eventJournalUpdate ( void* srTitle, void* srDescription );
	void eventCodexUpdate ( void* srTitle, void* srDescription );
	void eventAddNotification_BonusPower ( int PlotStateID );
	void PopulateNotificationOneParameter ( int nParam1, struct FSFXNotificationData* oNoteData, struct FSFXNotification* oNotification );
	struct FSFXNotificationData GetNotificationData ( struct FName nmNotificationType );
	void ShowNotification ( struct FSFXNotification* oNotification );
	void AddNotification_Custom ( float nDisplayTime, struct FString sTitle, struct FString sSubtitle, struct FString sBody, struct FString sImagePath, struct FName nRemoteEvent, struct FName nmType, struct FName nmSound, int Priority, int FlourishID, int nBarPercent, struct FName nmIcon, unsigned long bMini );
	void AddNotification_AccomplishmentUnlocked ( struct FAccomplishment* Data, struct FGrinderAccomplishment* Grinder );
	void AddNotification_AccomplishmentChange ( struct FString sTitle, struct FString sSubtitle, struct FString sBody, int currentCount, int totalCount, struct FString sImage );
	void AddNotification_AmmoRecovery ( int nAmount );
	void AddNotification_HeavyWeaponAmmoRecovery ( int nAmount );
	void AddNotification_ElementZeroRecovery ( int nAmount );
	void AddNotification_PlatinumRecovery ( int nAmount );
	void AddNotification_PalladiumRecovery ( int nAmount );
	void AddNotification_IridiumRecovery ( int nAmount );
	void AddNotification_ReputationChange ( int nAmount );
	void AddNotification_RenegadeChange ( int nAmount );
	void AddNotification_ParagonChange ( int nAmount );
	void AddNotification_MedigelRecovery ( int nAmount );
	void AddNotification_CreditRecovery ( int nAmount );
	void AddNotification_CodexChange ( );
	void AddNotification_JournalChange ( );
	void AddNotification ( struct FSFXNotification* oNotification );
};

UClass* UBioHintSystemBase::pClassPointer = NULL;

// Class SFXGame.BioLevelUpSystem
// 0x0004 (0x0040 - 0x003C)
class UBioLevelUpSystem : public UObject
{
public:
	float                                              ME2ImportReputationAmount;                        		// 0x003C (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1352 ];

		return pClassPointer;
	};

	int GetMaxLevel ( );
	void VerifyPlayerTalentPoints ( class Asfxpawn* Pawn );
	void SetME2ImportStartingValues ( struct FPlayerSaveRecord* PlayerRecord );
	void ME2ToME3_ParagonRenegade ( int Paragon_ME2, int Renegade_ME2, int* Paragon_ME3, int* Renegade_ME3 );
	void AutoLevelUpPowers ( class ABioPawn* Pawn );
	int GetTalentPointSum ( int Level, unsigned long bHenchman );
	bool LevelUpBioPawn ( class ASFXPawn_PlayerParty* Pawn, int newLevel );
	bool GetLevelFromXP ( int experience, int* Level );
	bool GetXPNeededForLevel ( int Level, int* experience );
	bool AttemptLevelUp ( class ABioBaseSquad* Squad );
};

UClass* UBioLevelUpSystem::pClassPointer = NULL;

// Class SFXGame.BioLoadingMovie
// 0x0024 (0x0060 - 0x003C)
class UBioLoadingMovie : public UObject
{
public:
	struct FString                                     MovieName;                                        		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                LoopBackFrame;                                    		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEventPairObject*                       LoadingMovieWwisePair;                            		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeInTime;                                       		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeOutTime;                                      		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 FadeOutWwiseEvent;                                		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinPlayTime;                                      		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1353 ];

		return pClassPointer;
	};

};

UClass* UBioLoadingMovie::pClassPointer = NULL;

// Class SFXGame.BioPhysicsSounds
// 0x0014 (0x0050 - 0x003C)
class UBioPhysicsSounds : public UObject
{
public:
	float                                              m_fMaxMass;                                       		// 0x003C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMaxSpeed;                                      		// 0x0040 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinTimeBetweenSoundByActor;                    		// 0x0044 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinSpeedToPlay;                                		// 0x0048 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bEnableLogging : 1;                             		// 0x004C (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1354 ];

		return pClassPointer;
	};

	float GetSpeedSpecifier ( class UPrimitiveComponent* oComp, float fSpeedToUse );
	float GetMassSpecifier ( class UPrimitiveComponent* oComp );
	void UpdateLastCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	void UpdateLastTimePlayed ( class UPrimitiveComponent* oComp );
	bool IsTooSlowToPlay ( class UPrimitiveComponent* oComp );
	bool IsSameCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	bool IsTooSoonToPlay ( class UPrimitiveComponent* oComp );
	bool CanPlay ( class UPrimitiveComponent* oComp0, class UPrimitiveComponent* oComp1, struct FCollisionImpactData* RigidCollisionData );
	int GetPhysMatWwiseType ( class UPhysicalMaterial* PhysMat );
	class UWwiseEvent* GetWwiseEvent ( class UPhysicalMaterial* PhysMat );
	void eventPlaySoundOnPhysMatAt ( class AGameReplicationInfo* GRI, class UPhysicalMaterial* PhysMat, class UPhysicalMaterial* PhysMatSweetener, struct FVector pos, TArray< struct FString > RTPCNames, TArray< float > RTPCValues );
};

UClass* UBioPhysicsSounds::pClassPointer = NULL;

// Class SFXGame.BioPlaypenVolume
// 0x0014 (0x0240 - 0x022C)
class ABioPlaypenVolume : public AVolume
{
public:
	struct FGuid                                       PlaypenGuid;                                      		// 0x022C (0x0010) [0x0000000000220003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	unsigned long                                      bSubtractive : 1;                                 		// 0x023C (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1355 ];

		return pClassPointer;
	};

};

UClass* ABioPlaypenVolume::pClassPointer = NULL;

// Class SFXGame.BioPlotTreasure
// 0x000C (0x0048 - 0x003C)
class UBioPlotTreasure : public UObject
{
public:
	class UBio2DA*                                     oPlotTreasureResources2DA;                        		// 0x003C (0x0004) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTreasure2DA;                         		// 0x0040 (0x0004) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTech2DA;                             		// 0x0044 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1356 ];

		return pClassPointer;
	};

	bool GetMapName ( struct FString* sOutMapName );
	bool GetPlotTreasureTechInt ( struct FName nmTech, struct FName nmNameHeader, struct FName nmHeader, int* nTechValue );
	bool GetPlotTreasureTechName ( struct FName nmTech, struct FName nmHeader, struct FName* nmTechName );
	bool GetPlotTreasureTreasureName ( int nTreasureId, struct FName nmHeader, struct FName* nmPlotTreasureName );
	bool GetPlotTreasureTreasureInt ( int nTreasureId, struct FName nmHeader, int* nPlotTreasureValue );
	bool GetPlotTreasureResourcesInt ( struct FName nmLevel, struct FName nmHeader, int* nPlotTreasureValue );
};

UClass* UBioPlotTreasure::pClassPointer = NULL;

// Class SFXGame.BioPower
// 0x002C (0x0068 - 0x003C)
class UBioPower : public UObject
{
public:
	struct FString                                     m_sRTPCName;                                      		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       m_nmPower;                                        		// 0x0048 (0x0008) [0x0000000000000000]              
	class UBioPowerScript*                             Script;                                           		// 0x0050 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class AController*                                 Instigator;                                       		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USFXPower*                                   NewPower;                                         		// 0x0058 (0x0004) [0x0000000000000000]              
	class AActor*                                      Owner;                                            		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                m_nSuppressedCount;                               		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      m_bFakePower : 1;                                 		// 0x0064 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      m_bDisableVFX : 1;                                		// 0x0064 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      m_bDisableDamageAndEffects : 1;                   		// 0x0064 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      m_bDisableAnimation : 1;                          		// 0x0064 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1357 ];

		return pClassPointer;
	};

	bool ShouldDisplayInHUD ( );
	bool GetDescription ( struct FString* sDescription );
	bool GetImpactText ( void** srImpactText );
	bool GetDisplayName ( struct FString* sDisplayName );
	int GetPowerIcon ( );
	bool CanCasterMoveDuringPower ( );
	void Tick ( float fDeltaTime );
	bool IsSuppressed ( );
	int SuppressPower ( unsigned long bSuppress );
	bool IsEnabled ( );
	unsigned char GetType ( );
	bool GetAnimSet ( class UAnimSet** oAnimSet );
	void CreatePowerScript ( );
	void InitializePower ( struct FName nmPower );
	unsigned char GetDiscipline ( );
	bool GetStopOnFirstHit ( );
	bool GetBlockedByObjects ( );
	float GetConeHalfAngle ( );
	float GetVFXIntensity ( );
	float GetEffectDuration ( );
	float GetImpactRadius ( );
	float GetMaximumRange ( );
	float GetMinimumRange ( );
	float GetProjectileRadius ( );
	float GetProjectileSpeed ( );
	float GetGlobalCooldown ( );
	float GetReleaseAnimRate ( );
	float GetCastingTime ( );
};

UClass* UBioPower::pClassPointer = NULL;

// Class SFXGame.BioPowerManager
// 0x004C (0x0088 - 0x003C)
class UBioPowerManager : public UObject
{
public:
	struct FMap_Mirror                                 m_mapGlobalCooldowns;                             		// 0x003C (0x003C) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< struct FPowerReservation >                 m_aReservations;                                  		// 0x0078 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                m_nCurrentReservationID;                          		// 0x0084 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1358 ];

		return pClassPointer;
	};

	bool eventCanImpactActor ( class AActor* oActor );
	void TickReservations ( float fDeltaTime );
	bool StartReservation ( int nReservationID );
	void ClearReservation ( int nReservationID );
	int MakeReservation ( class USFXPowerCustomActionBase* oPower, class APawn* oPawn, unsigned long bForceSuccess );
	void TickGlobalCooldowns ( float fDeltaTime );
	float GetGlobalCooldown ( struct FName nmPower );
	void SetGlobalCooldown ( struct FName nmPower, float fCooldown );
	void Tick ( float fDeltaTime );
	void ChooseTargetForPlayer ( class USFXPower* oPower, class AActor** oTarget, struct FVector* vTargetLocation );
	bool AreActorsFriendly ( class AActor* oFirstActor, class AActor* oSecondActor );
	bool CheckLOSToLocation ( class AActor* oSourceActor, struct FVector vStartLocation, struct FVector vEndLocation, float fMaxRange, unsigned long bIgnoreFriendlies, float fIgnoreCoverDistance, class AActor** oHitActor, struct FVector* vHitLocation, struct FVector* vHitNormal );
	bool CheckLOSToActor ( class AActor* oSourceActor, class AActor* oDestinationActor, struct FVector vStartLocation, float fMaxRange, unsigned long bIgnoreFriendlies, unsigned long bIgnorePawns, class AActor** oHitActor, struct FVector* vHitLocation, struct FVector* vHitNormal );
	void GetStartLocationForLOSCheck ( class APawn* Caster, struct FVector* vStartLocation );
};

UClass* UBioPowerManager::pClassPointer = NULL;

// Class SFXGame.BioPowerScript
// 0x0080 (0x00BC - 0x003C)
class UBioPowerScript : public UObject
{
public:
	TArray< class AActor* >                            m_ImpactedActors;                                 		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     m_vWorldImpactLocation;                           		// 0x0048 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vWorldImpactNormal;                             		// 0x0054 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vProjectileVelocity;                            		// 0x0060 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vProjectileLocation;                            		// 0x006C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vLocationToAimAt;                               		// 0x0078 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	class UForceFeedbackWaveform*                      m_ImpactWaveForm;                                 		// 0x0084 (0x0004) [0x0000000000000000]              
	class AActor*                                      m_oTargetToAimAt;                                 		// 0x0088 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	void*                                              Recommended_TargetVulnerable;                     		// 0x008C (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetOrganic;                     		// 0x0090 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetMachine;                     		// 0x0094 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetHasShields;                  		// 0x0098 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetHasBiotics;                  		// 0x009C (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetHasArmor;                    		// 0x00A0 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_NoMedigel;                         		// 0x00A4 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_NoSquadMemberDead;                 		// 0x00A8 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_NoSquadMemberInjured;              		// 0x00AC (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_WeaponPowerAlreadyOn;              		// 0x00B0 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TargetImmune;                      		// 0x00B4 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bWeaponModePower : 1;                           		// 0x00B8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bShouldTick : 1;                                  		// 0x00B8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bPlayerOrderedPowerUse : 1;                     		// 0x00B8 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1359 ];

		return pClassPointer;
	};

	void DebugDraw_Power ( class ABioHUD* H );
	struct FString eventGetHUDWheelIconInfo ( class ABioPawn* OwnerPawn );
	void ReloadAmmoPower ( class ABioPawn* Target, class ASFXWeapon* Weapon );
	void OnOwnerDied ( );
	void OnSquadMemberAdded ( class APawn* Pawn );
	void OnPowersLoaded ( );
	void OnPowerRankIncreased ( );
	void OnPowerAdded ( class USFXPower* Power );
	bool eventShouldUsePower ( class AActor* Caster, class AActor* Target, struct FString* sOptionalInfo );
	float GetDuration ( );
	float GetElapsedTime ( );
	bool PlayGuiSound ( struct FName nmSound );
	bool GetFloorLocation ( struct FVector vStartLocation, struct FVector* vFloorLocation );
	void GetCooldownResearchBonus ( float* fStaticResearchBonus );
	bool eventAdjustCooldown ( float* fCooldownTime );
	bool eventEffectUnapply ( class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted );
	bool eventOnImpact ( class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted );
	bool eventCanStartPower ( class AActor* oCaster );
	void eventTick ( float DeltaTime );
	void OnProjectileExploded ( class AActor* oCaster, struct FVector HitLocation, struct FVector HitNormal, struct FVector Velocity );
	void OnWeaponReload ( class ASFXWeapon* Weapon, unsigned long QuickReload );
	void OnWeaponUnequip ( class ASFXWeapon* Weapon );
	void OnWeaponEquip ( class ASFXWeapon* Weapon );
	void OnWeaponImpact ( class ASFXWeapon* Weapon, struct FImpactInfo Impact );
	void eventInitializePowerScript ( );
};

UClass* UBioPowerScript::pClassPointer = NULL;

// Class SFXGame.BioRadarMapBoundaries
// 0x000E (0x0204 - 0x01F6)
class ABioRadarMapBoundaries : public AActor
{
public:
	struct FVector                                     m_vBoundarySize;                                  		// 0x01F8 (0x000C) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1360 ];

		return pClassPointer;
	};

};

UClass* ABioRadarMapBoundaries::pClassPointer = NULL;

// Class SFXGame.BioSeqAct_GiveMissionXP_NativeBase
// 0x0014 (0x00C4 - 0x00B0)
class UBioSeqAct_GiveMissionXP_NativeBase : public USequenceAction
{
public:
	struct FName                                       CombatToken;                                      		// 0x00B0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              RewardAmount;                                     		// 0x00B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	void*                                              ObjectiveStringRef;                               		// 0x00BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bSkipNotifications : 1;                           		// 0x00C0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bCombatExperience : 1;                            		// 0x00C0 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1361 ];

		return pClassPointer;
	};

	int eventGetObjClassVersion ( );
	void Activated ( );
};

UClass* UBioSeqAct_GiveMissionXP_NativeBase::pClassPointer = NULL;

// Class SFXGame.BioSFResources
// 0x0024 (0x0060 - 0x003C)
class UBioSFResources : public UObject
{
public:
	TArray< struct FBioSFSoundAssetResource >          Sounds;                                           		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UBioSFScreenTip* >                   LoadScreenTips;                                   		// 0x0048 (0x000C) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	TArray< class UGFxMovieInfo* >                     Movies;                                           		// 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1362 ];

		return pClassPointer;
	};

};

UClass* UBioSFResources::pClassPointer = NULL;

// Class SFXGame.BioSocketSupermodel
// 0x000C (0x0374 - 0x0368)
class UBioSocketSupermodel : public USkeletalMesh
{
public:
	TArray< class USkeletalMesh* >                     Dependents;                                       		// 0x0368 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1363 ];

		return pClassPointer;
	};

};

UClass* UBioSocketSupermodel::pClassPointer = NULL;

// Class SFXGame.BioTacticalMoveToIndicator
// 0x000E (0x0204 - 0x01F6)
class ABioTacticalMoveToIndicator : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleSystem;                                   		// 0x01F8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_fFadeInTime;                                    		// 0x01FC (0x0004) [0x0000000000000000]              
	float                                              m_fTimePassed;                                    		// 0x0200 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1364 ];

		return pClassPointer;
	};

};

UClass* ABioTacticalMoveToIndicator::pClassPointer = NULL;

// Class SFXGame.SFXAccomplishmentManager
// 0x005C (0x0098 - 0x003C)
class USFXAccomplishmentManager : public UObject
{
public:
	TArray< struct FAccomplishment >                   AccomplishmentData;                               		// 0x003C (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< int >                                      AccomplishmentIsComplete;                         		// 0x0048 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< int >                                      AccomplishmentCompletionTimes;                    		// 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FAccomplishmentProgress >           AccomplishmentProgressData;                       		// 0x0060 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FGrinderAccomplishment >            GrinderAccomplishmentData;                        		// 0x006C (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FAchievementReward >                Rewards;                                          		// 0x0078 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FChallengeEvent >                   Challenges;                                       		// 0x0084 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class USFXAccomplishmentStorage*                   AccomplishmentStorage;                            		// 0x0090 (0x0004) [0x0000000000000000]              
	unsigned long                                      bChallengeSystemEnabled : 1;                      		// 0x0094 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      IsDataValidated : 1;                              		// 0x0094 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bIsSaving : 1;                                    		// 0x0094 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bPendingSave : 1;                                 		// 0x0094 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bSaveRequired : 1;                                		// 0x0094 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1365 ];

		return pClassPointer;
	};

	void Destroyed ( );
	class USFXOnlineJobSendMessage* eventCreateJobSendAchievementMessage ( int AchievementId );
	struct FName AccomplishmentProgressIndexToName ( int AccomplishmentProgressIndex );
	struct FName AccomplishmentIndexToName ( int AccomplishmentIndex );
	void LoadStorageData ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void LoadSettingsData ( class USFXProfileSettings* CurrentProfileSettings );
	void LoadAchievementData ( TArray< struct FAchievementDetails > AchievementsList, class ABioPlayerController* PC );
	void SaveComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void Save ( );
	unsigned char GetAccomplishmentParamsStorage ( unsigned char AchievementId, unsigned long IsMultiplayerOnly );
	unsigned char GetAccomplishmentStorage ( int ArrayIndex );
	bool UpdateGrinderAccomplishmentByValue ( int UpdateValue, struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool GrinderAccomplishmentIncrement ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool SetGrinderAccomplishmentProgressWithUpdate ( struct FName AccomplishmentProgressName, int Progress, class ABioPlayerController* PC );
	int GetGrinderAccomplishmentProgress ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	void SetGrinderAccomplishmentProgress ( struct FName AccomplishmentProgressName, int Progress, class ABioPlayerController* PC );
	void GrinderAccomplishmentReset ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool GetGrinderAccomplishment ( struct FName AccomplishmentName, TArray< struct FGrinderAccomplishment >* GAList );
	bool CanUnlockAccomplishment ( struct FName AccomplishmentName );
	bool HasCompletedAccomplishment ( struct FName AccomplishmentName );
	unsigned char GetProfileSettingFromAccomplishmentProgress ( struct FName AccomplishmentProgressName );
	bool AreAllChildAccomplishmentsCompleted ( struct FName ParentAccomplishment );
	void UpdateAccomplishmentTree ( struct FName ParentAccomplishment, class ABioPlayerController* PC );
	bool SetAccomplishmentUncompleted ( struct FName AccomplishmentName, class ABioPlayerController* PC );
	bool SetAccomplishmentCompleted ( struct FName AccomplishmentName, class ABioPlayerController* PC );
	bool PropagateAccomplishmentCompletion ( int Index, unsigned long IsComplete, class ABioPlayerController* PC, unsigned long bSaveProfile );
	void ResetChallengeRewards ( );
	void SetCurrentReward ( int nRewardID );
	void GetCurrentReward ( int* nRewardID, int* nRewardLevel );
	void UpdateN7RatingChallenge ( int n7Rating, class ABioPlayerController* PC );
	void UpdateMiscChallenges ( unsigned char ChallengeType, class ABioPlayerController* PC );
	void UpdatePowerChallenges ( struct FName PowerName, class UClass* PowerDamageType, unsigned long bCombo, class ABioPlayerController* PC );
	void UpdateMedalChallenges ( unsigned char Medal, class ABioPlayerController* PC );
	void UpdateWaveChallenges ( class ABioPlayerController* PC );
	void UpdateMatchChallenges ( int PlayerID, class ABioPlayerController* PC );
	void UpdateDamageScoreChallenges ( float Score, void* DamageSource, class ABioPlayerController* PC );
	void UpdateEnemyScoreChallenges ( class UClass* KilledPawnClass, float Score, class ABioPlayerController* PC );
	void UpdateKillChallenges ( class UClass* KilledPawnClass, class UClass* KillingDamageType, void* KillingSource, unsigned long bHeadShot, unsigned long bHeadGib, class ABioPlayerController* PC );
	void GetCurrentChallengeData ( class ABioPlayerController* PC, struct FChallengeEvent* CurrentEvent );
	void GetOtherAccomplishments ( struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetPowerAccomplishments ( class UClass* PowerDamageType, struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetMedalAccomplishments ( struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetWaveAccomplishments ( struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetMatchAccomplishments ( struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetDamageScoreAccomplishments ( struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetEnemyScoreAccomplishments ( class UClass* KilledPawnClass, struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void GetKillAccomplishments ( class UClass* KilledPawnClass, class UClass* KillingDamageType, struct FChallengeEvent* CurrentEvent, TArray< struct FName >* Accomplishments );
	void ResetChallengeGroupProgress ( struct FName ChallengeGroupName );
	bool CanUpdateAccomplishmentProgress ( int CurrentProgress, int GrinderIndex, int AccomplishmentIndex );
	void OnGrantedEntitlement ( struct FBWEntitlementId Id, int nResult );
	int GetTotalChallengePoints ( );
	void AddChallengePointsEarned ( int PointsEarned );
	bool UnlockReward ( struct FName AccomplishmentName, int PointsEarned, unsigned long bIsMultiplayerOnly, class ABioPlayerController* PC );
	void Validate ( );
	void eventInitialize ( );
};

UClass* USFXAccomplishmentManager::pClassPointer = NULL;

// Class SFXGame.SFXActorFactoryRigidBody
// 0x0000 (0x0095 - 0x0095)
class USFXActorFactoryRigidBody : public UActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1366 ];

		return pClassPointer;
	};

};

UClass* USFXActorFactoryRigidBody::pClassPointer = NULL;

// Class SFXGame.BioActorFactoryPhysicsActor
// 0x0000 (0x0095 - 0x0095)
class UBioActorFactoryPhysicsActor : public USFXActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1367 ];

		return pClassPointer;
	};

};

UClass* UBioActorFactoryPhysicsActor::pClassPointer = NULL;

// Class SFXGame.SFXAnimationMarker
// 0x0012 (0x0208 - 0x01F6)
class ASFXAnimationMarker : public AActor
{
public:
	struct FString                                     Text;                                             		// 0x01F8 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UStaticMeshComponent*                        ZoneMeshComp;                                     		// 0x0204 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1368 ];

		return pClassPointer;
	};

};

UClass* ASFXAnimationMarker::pClassPointer = NULL;

// Class SFXGame.SFXArmourPiece
// 0x007C (0x00B8 - 0x003C)
class USFXArmourPiece : public UObject
{
public:
	TArray< struct FName >                             HideBones;                                        		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FVector                                     RelativeBoneLocation;                             		// 0x0048 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    RelativeBoneRotation;                             		// 0x0054 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RelativeBoneScale;                                		// 0x0060 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    Rotation;                                         		// 0x006C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AttachSocket;                                     		// 0x0078 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BoneName;                                         		// 0x0080 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ArmourName;                                       		// 0x0088 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UObject*                                     Mesh;                                             		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UObject*                                     DestroyedMesh;                                    		// 0x0094 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicalMaterial*                           PhysMaterialOverride;                             		// 0x0098 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicsAsset*                               PhysicsAsset;                                     		// 0x009C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UPrimitiveComponent*                         AttachInstance;                                   		// 0x00A0 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UParticleSystem*                             PS_Destruction;                                   		// 0x00A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 DestructionSound;                                 		// 0x00A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxHealth;                                        		// 0x00AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CurrentHealth;                                    		// 0x00B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bMeshStartsHidden : 1;                            		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bStartsDetached : 1;                              		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bCanBeDamaged : 1;                                		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bNotifyOnHit : 1;                                 		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bPassThroughDamage : 1;                           		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1369 ];

		return pClassPointer;
	};

	void UpdateMorphWeights ( class USkeletalMeshComponent* SkelMeshComp, float NewWeight );
	void UpdateAppearance ( );
	void eventActivateEffects ( class AActor* oTarget );
	void DetachFromActor ( class AActor* oTarget, unsigned long bDestroyed, struct FTraceHitInfo* HitInfo );
	bool AttachToActor ( class AActor* oTarget );
};

UClass* USFXArmourPiece::pClassPointer = NULL;

// Class SFXGame.SFXAsyncAssetLoader
// 0x0028 (0x0064 - 0x003C)
class USFXAsyncAssetLoader : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x003C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	TArray< struct FSFXAsyncPackageRequest >           m_aPackageRequests;                               		// 0x0040 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSFXAsyncLoadGroupCallback >        m_OnGroupLoadedCallbacks;                         		// 0x004C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnAsyncGroupLoaded__Delegate;                   		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1370 ];

		return pClassPointer;
	};

	bool GetAssetsForGroup ( struct FName nmAsyncGroupTag, TArray< class UObject* >* oAssets );
	void ClearAsyncGroup ( struct FName nmAsyncGroupTag );
	bool IsAsyncGroupLoaded ( struct FName nmAsyncGroupTag );
	void AsyncLoadAssets ( struct FName nmAsyncGroupTag, struct FScriptDelegate AsyncGroupLoaded, TArray< struct FSFXAsyncAssetRequest >* Assets );
	void OnAsyncGroupLoaded ( );
};

UClass* USFXAsyncAssetLoader::pClassPointer = NULL;

// Class SFXGame.SFXCombatZone
// 0x0010 (0x023C - 0x022C)
class ASFXCombatZone : public AVolume
{
public:
	struct FGuid                                       CombatZoneGuid;                                   		// 0x022C (0x0010) [0x0000000000220003]              ( CPF_Edit | CPF_Const | CPF_EditConst )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1371 ];

		return pClassPointer;
	};

};

UClass* ASFXCombatZone::pClassPointer = NULL;

// Class SFXGame.SFXCustomReachSpec
// 0x0006 (0x008C - 0x0086)
class USFXCustomReachSpec : public UAdvancedReachSpec
{
public:
	class APawn*                                       BlockingPawn;                                     		// 0x0088 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1372 ];

		return pClassPointer;
	};

};

UClass* USFXCustomReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXBoostReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXBoostReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1373 ];

		return pClassPointer;
	};

};

UClass* USFXBoostReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXClimbWallReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXClimbWallReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1374 ];

		return pClassPointer;
	};

};

UClass* USFXClimbWallReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXJumpDownReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXJumpDownReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1375 ];

		return pClassPointer;
	};

};

UClass* USFXJumpDownReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXJumpReachSpec
// 0x0008 (0x0094 - 0x008C)
class USFXJumpReachSpec : public USFXCustomReachSpec
{
public:
	float                                              MaxHeight;                                        		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MovePercentToReachMaxHeight;                      		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1376 ];

		return pClassPointer;
	};

};

UClass* USFXJumpReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXLadderReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXLadderReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1377 ];

		return pClassPointer;
	};

};

UClass* USFXLadderReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXLargeBoostReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXLargeBoostReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1378 ];

		return pClassPointer;
	};

};

UClass* USFXLargeBoostReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXLargeClimbReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXLargeClimbReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1379 ];

		return pClassPointer;
	};

};

UClass* USFXLargeClimbReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXLargeMantleReachSpec
// 0x0000 (0x008C - 0x008C)
class USFXLargeMantleReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1380 ];

		return pClassPointer;
	};

};

UClass* USFXLargeMantleReachSpec::pClassPointer = NULL;

// Class SFXGame.SFXLeapReachSpecBase
// 0x0004 (0x0090 - 0x008C)
class USFXLeapReachSpecBase : public USFXCustomReachSpec
{
public:
	float                                              LeapHeight;                                       		// 0x008C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1381 ];

		return pClassPointer;
	};

};

UClass* USFXLeapReachSpecBase::pClassPointer = NULL;

// Class SFXGame.SFXLeapReachSpecHumanoid
// 0x0000 (0x0090 - 0x0090)
class USFXLeapReachSpecHumanoid : public USFXLeapReachSpecBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1382 ];

		return pClassPointer;
	};

};

UClass* USFXLeapReachSpecHumanoid::pClassPointer = NULL;

// Class SFXGame.SFXLeapReachSpecLarge
// 0x0000 (0x0090 - 0x0090)
class USFXLeapReachSpecLarge : public USFXLeapReachSpecBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1383 ];

		return pClassPointer;
	};

};

UClass* USFXLeapReachSpecLarge::pClassPointer = NULL;

// Class SFXGame.SFXDamageType
// 0x005A (0x00E2 - 0x0088)
class USFXDamageType : public UDamageType
{
public:
	TArray< struct FHitReactionSet >                   HitReactions;                                     		// 0x0088 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct FResistanceInfo                             Resistance;                                       		// 0x0094 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              WoundPct;                                         		// 0x00A0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              DamageRadius;                                     		// 0x00A4 (0x0004) [0x0000000000000000]              
	float                                              HeadGibChance;                                    		// 0x00A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UForceFeedbackWaveform*                      ShieldHitFFWaveform;                              		// 0x00AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class URvrClientEffectInterface*                   CE_DeathEffect;                                   		// 0x00B0 (0x0004) [0x0000000000000000]              
	int                                                DeathEffectPriority;                              		// 0x00B4 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_PlayerFrameBufferEffect;                       		// 0x00B8 (0x0004) [0x0000000000000000]              
	float                                              Range_Melee;                                      		// 0x00BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Short;                                      		// 0x00C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Medium;                                     		// 0x00C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Long;                                       		// 0x00C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FlinchChance;                                     		// 0x00CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FlinchDistance;                                   		// 0x00D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	void*                                              SourceDisplayName;                                		// 0x00D4 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 DeathSoundEffect;                                 		// 0x00D8 (0x0004) [0x0000000000000000]              
	unsigned long                                      bSpawnWeaponImpacts : 1;                          		// 0x00DC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIgnoreShields : 1;                               		// 0x00DC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bPartBasedDamageDisabled : 1;                     		// 0x00DC (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bHealthDamage : 1;                                		// 0x00DC (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bDamagesFriends : 1;                              		// 0x00DC (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bCanGibHead : 1;                                  		// 0x00DC (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bIsMelee : 1;                                     		// 0x00DC (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      bCausesNormalizedDamage : 1;                      		// 0x00DC (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      bUsesDamageScaling : 1;                           		// 0x00DC (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      bIgnoreDamageGating : 1;                          		// 0x00DC (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      bAlwaysPlayHitReact : 1;                          		// 0x00DC (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      bCriticalHit : 1;                                 		// 0x00DC (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      bMPKillDamage : 1;                                		// 0x00DC (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      bCausesRagdoll : 1;                               		// 0x00DC (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
