/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: sfxgamempcontentdlc_shared_mp_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function sfxgamempcontent.sfxwave_operation.GetCreditsReward
// [0x00020102] 
struct USFXEngagement_Retrieve_DLC_Base_execGetCreditsReward_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fReward;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.GetCreditBudget
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execGetCreditBudget_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxwave_operation.DistributeObjectiveScore
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execDistributeObjectiveScore_Parms
{
	// float                                           fCompletionTime;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           fBonusRatio;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fBaseReward;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           fBonusReward;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           fModifiedBaseReward;                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           fModifiedBonusReward;                             		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           fModifiedTotalReward;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	// class Asfxplayercontroller*                     PC;                                               		// 0x001C (0x0004) [0x0000000000000000]              
	// class ASFXPawn_Player*                          Player;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// class Usfxscoremanager*                         ScoreManager;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	// class USFXMPEventTicker*                        EventTicker;                                      		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.CountdownTimerExpired
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execCountdownTimerExpired_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.CancelCountdownTimer
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execCancelCountdownTimer_Parms
{
	// class Asfxplayercontroller*                     PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.LocalPlayerTimeWarningHint
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execLocalPlayerTimeWarningHint_Parms
{
	// class Asfxplayercontroller*                     Player;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           TimeRemaining;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.SetTimeLimit
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execSetTimeLimit_Parms
{
	float                                              TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxwave_operation.BeginWaveTimeLimit
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execBeginWaveTimeLimit_Parms
{
	// float                                           TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DeactivateObjectiveCombatZone
// [0x00020003] ( FUNC_Final )
struct USFXEngagement_Retrieve_DLC_Base_execDeactivateObjectiveCombatZone_Parms
{
	class AActor*                                      ObjectiveActor;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class USFXWave_Horde*                           HordeWave;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.ActivateObjectiveCombatZone
// [0x00020003] ( FUNC_Final )
struct USFXEngagement_Retrieve_DLC_Base_execActivateObjectiveCombatZone_Parms
{
	class AActor*                                      ObjectiveActor;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class USFXWave_Horde*                           HordeWave;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnDestroyed
// [0x00020102] 
struct USFXEngagement_Retrieve_DLC_Base_execPawnDestroyed_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnRevived
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execPawnRevived_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnDowned
// [0x00020102] 
struct USFXEngagement_Retrieve_DLC_Base_execPawnDowned_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DetermineObjectivesToSpawn
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execDetermineObjectivesToSpawn_Parms
{
	// class USFXOperation_ObjectiveData*              ObjectiveDataIter;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FSFXOperation_ObjectiveRequirement       ObjectiveRequiredIter;                            		// 0x0004 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             i;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
	// unsigned long                                   FoundValidObjective : 1;                          		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FSFXOperation_ObjectiveGroupToSpawn      ObjectiveGroupToSpawn;                            		// 0x0020 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class USFXOperation_ObjectiveData* >    CommonObjectiveData;                              		// 0x0034 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FSFXWaveAssetLoadData                    NewAssetLoadData;                                 		// 0x0040 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nRandom;                                          		// 0x0054 (0x0004) [0x0000000000000000]              
	// TArray< unsigned char >                         ValidLocations;                                   		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< struct FSFXOperation_ObjectiveMeshInfo > ValidMeshes;                                      		// 0x0064 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxwave_operation.RateEnemyStart
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execRateEnemyStart_Parms
{
	class ANavigationPoint*                            NavPoint;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Rating;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           CurrentRating;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           Distance;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Objective;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DelayedFinishWave
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execDelayedFinishWave_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.FinishWave
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execFinishWave_Parms
{
	// class AActor*                                   ActorIter;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASFXGRI*                                  GRI;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.ShowBeginWaveMessage
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execShowBeginWaveMessage_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.BeginWave
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execBeginWave_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   NewActor;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             i;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             K;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             NumObjectivesSelected;                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > LocalAvailableSpawnPoints;                        		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class USFXOperation_ObjectiveData* >    ObjectivesToSpawn;                                		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > ObjectiveSpawnPoints;                             		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > RandomizedSpawnPoints;                            		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   FoundEnoughSpawnsForObjective : 1;                		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UObject*                                  ObjectTemplate;                                   		// 0x004C (0x0004) [0x0000000000000000]              
	// int                                             AllocateSpawnPointPass;                           		// 0x0050 (0x0004) [0x0000000000000000]              
	// struct FSFXOperation_ObjectiveSpawnPointData    ObjectiveSpawnData;                               		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FMapSpecificSpawnPointFix                SpawnPointFix;                                    		// 0x0060 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FVector                                  SpawnOffset;                                      		// 0x0088 (0x000C) [0x0000000000000000]              
	// float                                           CollisionCylinderHeightAdd;                       		// 0x0094 (0x0004) [0x0000000000000000]              
	// float                                           CollisionCylinderRadiusAdd;                       		// 0x0098 (0x0004) [0x0000000000000000]              
	// class UCylinderComponent*                       CollisionCylinder;                                		// 0x009C (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function sfxgamempcontent.sfxwave_operation.ObjectiveSpawnSort
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execObjectiveSpawnSort_Parms
{
	class ASFXOperation_ObjectiveSpawnPoint*           A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ASFXOperation_ObjectiveSpawnPoint*           B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxwave_operation.InitializeWave
// [0x00020002] 
struct USFXEngagement_Retrieve_DLC_Base_execInitializeWave_Parms
{
	class ASFXWaveManager*                             OwnerManager;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxwave_operation.GetCreditsReward
// [0x00020102] 
struct USFXEngagement_MobileAnnex_Base_execGetCreditsReward_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fReward;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.GetCreditBudget
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execGetCreditBudget_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxwave_operation.DistributeObjectiveScore
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execDistributeObjectiveScore_Parms
{
	// float                                           fCompletionTime;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           fBonusRatio;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fBaseReward;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           fBonusReward;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           fModifiedBaseReward;                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           fModifiedBonusReward;                             		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           fModifiedTotalReward;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	// class Asfxplayercontroller*                     PC;                                               		// 0x001C (0x0004) [0x0000000000000000]              
	// class ASFXPawn_Player*                          Player;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// class Usfxscoremanager*                         ScoreManager;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	// class USFXMPEventTicker*                        EventTicker;                                      		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.CountdownTimerExpired
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execCountdownTimerExpired_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.CancelCountdownTimer
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execCancelCountdownTimer_Parms
{
	// class Asfxplayercontroller*                     PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.LocalPlayerTimeWarningHint
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execLocalPlayerTimeWarningHint_Parms
{
	// class Asfxplayercontroller*                     Player;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           TimeRemaining;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.SetTimeLimit
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execSetTimeLimit_Parms
{
	float                                              TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function sfxgamempcontent.sfxwave_operation.BeginWaveTimeLimit
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execBeginWaveTimeLimit_Parms
{
	// float                                           TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DeactivateObjectiveCombatZone
// [0x00020003] ( FUNC_Final )
struct USFXEngagement_MobileAnnex_Base_execDeactivateObjectiveCombatZone_Parms
{
	class AActor*                                      ObjectiveActor;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class USFXWave_Horde*                           HordeWave;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.ActivateObjectiveCombatZone
// [0x00020003] ( FUNC_Final )
struct USFXEngagement_MobileAnnex_Base_execActivateObjectiveCombatZone_Parms
{
	class AActor*                                      ObjectiveActor;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class USFXWave_Horde*                           HordeWave;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnDestroyed
// [0x00020102] 
struct USFXEngagement_MobileAnnex_Base_execPawnDestroyed_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnRevived
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execPawnRevived_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.PawnDowned
// [0x00020102] 
struct USFXEngagement_MobileAnnex_Base_execPawnDowned_Parms
{
	class ABioPawn*                                    Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   ObjectiveActor;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	// class Asfxoperationobjective*                   Objective;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DetermineObjectivesToSpawn
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execDetermineObjectivesToSpawn_Parms
{
	// class USFXOperation_ObjectiveData*              ObjectiveDataIter;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FSFXOperation_ObjectiveRequirement       ObjectiveRequiredIter;                            		// 0x0004 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             i;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
	// unsigned long                                   FoundValidObjective : 1;                          		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FSFXOperation_ObjectiveGroupToSpawn      ObjectiveGroupToSpawn;                            		// 0x0020 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class USFXOperation_ObjectiveData* >    CommonObjectiveData;                              		// 0x0034 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FSFXWaveAssetLoadData                    NewAssetLoadData;                                 		// 0x0040 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nRandom;                                          		// 0x0054 (0x0004) [0x0000000000000000]              
	// TArray< unsigned char >                         ValidLocations;                                   		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< struct FSFXOperation_ObjectiveMeshInfo > ValidMeshes;                                      		// 0x0064 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function sfxgamempcontent.sfxwave_operation.RateEnemyStart
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execRateEnemyStart_Parms
{
	class ANavigationPoint*                            NavPoint;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Rating;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           CurrentRating;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           Distance;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Objective;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.DelayedFinishWave
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execDelayedFinishWave_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.FinishWave
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execFinishWave_Parms
{
	// class AActor*                                   ActorIter;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AAIController*                            AI;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASFXGRI*                                  GRI;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function sfxgamempcontent.sfxwave_operation.ShowBeginWaveMessage
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execShowBeginWaveMessage_Parms
{
};

// Function sfxgamempcontent.sfxwave_operation.BeginWave
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execBeginWave_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   NewActor;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             i;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             K;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             NumObjectivesSelected;                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > LocalAvailableSpawnPoints;                        		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class USFXOperation_ObjectiveData* >    ObjectivesToSpawn;                                		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > ObjectiveSpawnPoints;                             		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< class ASFXOperation_ObjectiveSpawnPoint* > RandomizedSpawnPoints;                            		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   FoundEnoughSpawnsForObjective : 1;                		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UObject*                                  ObjectTemplate;                                   		// 0x004C (0x0004) [0x0000000000000000]              
	// int                                             AllocateSpawnPointPass;                           		// 0x0050 (0x0004) [0x0000000000000000]              
	// struct FSFXOperation_ObjectiveSpawnPointData    ObjectiveSpawnData;                               		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FMapSpecificSpawnPointFix                SpawnPointFix;                                    		// 0x0060 (0x0028) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FVector                                  SpawnOffset;                                      		// 0x0088 (0x000C) [0x0000000000000000]              
	// float                                           CollisionCylinderHeightAdd;                       		// 0x0094 (0x0004) [0x0000000000000000]              
	// float                                           CollisionCylinderRadiusAdd;                       		// 0x0098 (0x0004) [0x0000000000000000]              
	// class UCylinderComponent*                       CollisionCylinder;                                		// 0x009C (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function sfxgamempcontent.sfxwave_operation.ObjectiveSpawnSort
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execObjectiveSpawnSort_Parms
{
	class ASFXOperation_ObjectiveSpawnPoint*           A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ASFXOperation_ObjectiveSpawnPoint*           B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function sfxgamempcontent.sfxwave_operation.InitializeWave
// [0x00020002] 
struct USFXEngagement_MobileAnnex_Base_execInitializeWave_Parms
{
	class ASFXWaveManager*                             OwnerManager;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetCurrentNameText
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetCurrentNameText_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_TeamSetHenchman
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_TeamSetHenchman_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sName;                                            		// 0x0004 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sIconResource;                                    		// 0x0010 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_TeamSetVisible
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_TeamSetVisible_Parms
{
	unsigned long                                      bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetModDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetModDisplay_Parms
{
	int                                                nDisplay;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sName;                                            		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sImgPath;                                         		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_AddWeaponStat
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_AddWeaponStat_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              fValue;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fBonus;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCompare;                                         		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_ClearWeaponStatsDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_ClearWeaponStatsDisplay_Parms
{
};

// Function SFXGame.sfxgui_weaponselection.AS_SelectWeaponSlot
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SelectWeaponSlot_Parms
{
	int                                                nSlotID;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_PerformPlayerWeaponAction
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_PerformPlayerWeaponAction_Parms
{
	unsigned long                                      bAccept : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_ScrollInfoText
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_ScrollInfoText_Parms
{
	float                                              fScroll;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetSlotNewIcon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetSlotNewIcon_Parms
{
	int                                                nSlot;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bHasNew : 1;                                      		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetWeaponAction
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetWeaponAction_Parms
{
	struct FString                                     sButtonText;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sCallbackMethodName;                              		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetInventoryWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetInventoryWeapon_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sDesc;                                            		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sIconResource;                                    		// 0x0018 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bNew : 1;                                         		// 0x0024 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                nNum;                                             		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nTotal;                                           		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFlourish : 1;                                    		// 0x0030 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     sClassPath;                                       		// 0x0034 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetWeightDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetWeightDisplay_Parms
{
	int                                                nPercent;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nComparePct;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sBarLabel;                                        		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sInfo;                                            		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetWeaponInfoDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetWeaponInfoDisplay_Parms
{
	struct FString                                     sWeaponName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sWeaponDescription;                               		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sCategory;                                        		// 0x0018 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sWeaponImage;                                     		// 0x0024 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetWeaponSlot
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetWeaponSlot_Parms
{
	int                                                nSlotID;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nWeaponID;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sWeaponIconResource;                              		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nWeaponIconIndex;                                 		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nNumOtherWeapons;                                 		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bHaveNewWeapons : 1;                              		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                nCategory;                                        		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bValid : 1;                                       		// 0x0024 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bHasModsAvailable : 1;                            		// 0x0028 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetLoading
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetLoading_Parms
{
	unsigned long                                      bLoading : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     sText;                                            		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.AS_SetVisible
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execAS_SetVisible_Parms
{
	unsigned long                                      bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.HandleInputEvent
// [0x00024802] ( FUNC_Event )
struct USFXGUI_MPWeaponSelection_DLC_eventHandleInputEvent_Parms
{
	unsigned char                                      Event;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              fValue;                                           		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.sfxgui_weaponselection.PlayerDiscardWeaponCallback
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execPlayerDiscardWeaponCallback_Parms
{
	class UBioSFHandler_MessageBox*                    oMsgBox;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nChoiceID;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bCancelled : 1;                                   		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.PromptPlayerToDiscardMPWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execPromptPlayerToDiscardMPWeapon_Parms
{
	int                                                nWeapCategory;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             nIndex;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             nOption1;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nOption2;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	// void*                                           srOption1;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// void*                                           srOption2;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	// class UBioSFHandler_MessageBox*                 oMB;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.CheckCanEquipWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execCheckCanEquipWeapon_Parms
{
	int                                                nWeapCategory;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nEquippedCount;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.CheckCanSelectWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execCheckCanSelectWeapon_Parms
{
	int                                                nWeapCategory;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGame.sfxgui_weaponselection.UpdateWeaponEncumbranceDisplay
// [0x00820003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execUpdateWeaponEncumbranceDisplay_Parms
{
	// class ASFXPawn_Player*                          oPlayerPawn;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             nWeapIndex;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FSFXWeaponSelectWeaponData               oWeapData;                                        		// 0x000C (0x00BC) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// float                                           fEncumbrance;                                     		// 0x00C8 (0x0004) [0x0000000000000000]              
	// int                                             nBarPercent;                                      		// 0x00CC (0x0004) [0x0000000000000000]              
	// int                                             nDisplayValue;                                    		// 0x00D0 (0x0004) [0x0000000000000000]              
	// struct FString                                  sEncumbranceValue;                                		// 0x00D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// float                                           fAccuracy;                                        		// 0x00E0 (0x0004) [0x0000000000000000]              
	// float                                           fDamage;                                          		// 0x00E4 (0x0004) [0x0000000000000000]              
	// float                                           fRoF;                                             		// 0x00E8 (0x0004) [0x0000000000000000]              
	// float                                           fCapacity;                                        		// 0x00EC (0x0004) [0x0000000000000000]              
	// float                                           fWeight;                                          		// 0x00F0 (0x0004) [0x0000000000000000]              
	// struct FSFXWeaponUIStats                        WeaponStats;                                      		// 0x00F4 (0x0014) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.UpdateCurrentLoadoutWeaponDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execUpdateCurrentLoadoutWeaponDisplay_Parms
{
	// int                                             nWeapIndex;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.SelectNextHenchman
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSelectNextHenchman_Parms
{
	// int                                             N;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.SelectPreviousHenchman
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSelectPreviousHenchman_Parms
{
	// int                                             N;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.WeaponSelectionItemChanged
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execWeaponSelectionItemChanged_Parms
{
};

// Function SFXGame.sfxgui_weaponselection.WeaponLoadoutItemChanged
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execWeaponLoadoutItemChanged_Parms
{
	int                                                nID;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nCategory;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.SwitchToWeaponLoadout
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSwitchToWeaponLoadout_Parms
{
	// class ASFXPawn_Player*                          oPlayerPawn;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.UndoWeaponSelection
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execUndoWeaponSelection_Parms
{
};

// Function SFXGame.sfxgui_weaponselection.SelectPrevWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSelectPrevWeapon_Parms
{
	// int                                             nInventoryIndex;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.SelectNextWeapon
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSelectNextWeapon_Parms
{
	// int                                             nInventoryIndex;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.DisplayCurrentWeaponSelection
// [0x00820003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execDisplayCurrentWeaponSelection_Parms
{
	unsigned long                                      bFlourish : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// int                                             nInventoryIndex;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FSFXWeaponSelectWeaponData               oData;                                            		// 0x0008 (0x00BC) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bIsNew : 1;                                       		// 0x00C4 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SFXGame.sfxgui_weaponselection.SwitchToWeaponSelection
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSwitchToWeaponSelection_Parms
{
	int                                                nWeaponType;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGame.sfxgui_weaponselection.MainMovieLoaded
// [0x00020001] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execMainMovieLoaded_Parms
{
};

// Function SFXGame.sfxgui_weaponselection.SetWeaponInfoDisplay
// [0x00824003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSetWeaponInfoDisplay_Parms
{
	int                                                nWeaponIndex;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nCategory;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// struct FSFXWeaponSelectWeaponData               oData;                                            		// 0x0008 (0x00BC) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// void*                                           srCategoryTitle;                                  		// 0x00C4 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.SetWeaponModsDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSetWeaponModsDisplay_Parms
{
	int                                                nWeapIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// TArray< struct FName >                          WeaponMods;                                       		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nMod;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             nModDataIndex;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FSFXWeaponModData                        Mod;                                              		// 0x0018 (0x006C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FString                                  ImagePath;                                        		// 0x0084 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGame.sfxgui_weaponselection.SetWeaponStatsDisplay
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execSetWeaponStatsDisplay_Parms
{
	int                                                nWeapIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bDoCompare : 1;                                   		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FSFXWeaponUIStats                        oModValues;                                       		// 0x0008 (0x0014) [0x0000000000000000]              
	// struct FSFXWeaponUIStats                        oCompareModValues;                                		// 0x001C (0x0014) [0x0000000000000000]              
	// float                                           fValue;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           fBonus;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           fCompare;                                         		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.RestorePowerBonuses
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execRestorePowerBonuses_Parms
{
	// class ASFXWeapon*                               pWeapon;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 pPawn;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nAmmoIndex;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// class USFXPowerCustomAction_AmmoPowerBase*      AmmoPower;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// class ABioBaseSquad*                            pSquad;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SFXGame.sfxgui_weaponselection.MakeLoadoutsActive
// [0x00020003] ( FUNC_Final )
struct USFXGUI_MPWeaponSelection_DLC_execMakeLoadoutsActive_Parms
