/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: sfxgamempcontent_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MAX_SQUAD_MEDALS                                   10
#define CONST_NUM_TICKER_SLOTS                                   4
#define CONST_NUM_OBJECTIVE_CIRCLES                              4
#define CONST_VOICE_CHAT_ICON_UPDATE_FREQUENCY                   0.5
#define CONST_VOIP_REMOTE_HEADSETOK                              16
#define CONST_MAX_MP_WEAPONS                                     2
#define CONST_MAX_POWERS                                         6
#define CONST_MAX_WEAPON_MODS                                    2

	MatchTimer_AllPlayersReady                         = 1,
	MatchTimer_WaitingOnLastMan                        = 2,
	MatchTimer_MAX                                     = 3
};*/

// Enum sfxgamempcontent.sfxgawreinforcementmatchconsumable.EUpgradeSlotType
/*enum EUpgradeSlotType
{
	Slot_Ammo                                          = 0,
	Slot_Weapon                                        = 1,
	Slot_Armor                                         = 2,
	Slot_Gear                                          = 3,
	Slot_MAX                                           = 4
};*/

// Enum sfxgamempcontent.sfxgrimp.EGameStatus
/*enum EGameStatus
{
	GS_None                                            = 0,
	GS_PendingMatch                                    = 1,
	GS_MatchInProgress                                 = 2,
	GS_MatchOver_Win                                   = 3,
	GS_MatchOver_Lost                                  = 4,
	GS_ReturningToMainMenu                             = 5,
	GS_MAX                                             = 6
};*/

// Enum sfxgamempcontent.sfxgui_mpappearance.EAppearanceMenuItemState
/*enum EAppearanceMenuItemState
{
	EAppearanceMenuItemState_Normal                    = 0,
	EAppearanceMenuItemState_Disabled                  = 1,
	EAppearanceMenuItemState_New                       = 2,
	EAppearanceMenuItemState_MAX                       = 3
};*/

// Enum sfxgamempcontent.sfxlobbyflow.ELobbySubscreen
/*enum ELobbySubscreen
{
	LSS_None                                           = 0,
	LSS_SelectCharacter                                = 1,
	LSS_MissionSetup                                   = 2,
	LSS_Character                                      = 3,
	LSS_Weapons                                        = 4,
	LSS_Store                                          = 5,
	LSS_Leaderboards                                   = 6,
	LSS_MatchResults                                   = 7,
	LSS_MatchRewards                                   = 8,
	LSS_Appearance                                     = 9,
	LSS_MatchConsumables                               = 10,
	LSS_MultiplayerMenu                                = 11,
	LSS_Lobby                                          = 12,
	LSS_Squad                                          = 13,
	LSS_TalentsLevelUp                                 = 14,
	LSS_MAX                                            = 15
};*/

// Enum sfxgamempcontent.sfxobjective_retrieve_pickupobject.EPickupObjectEvent
/*enum EPickupObjectEvent
{
	EPO_PickedUp                                       = 0,
	EPO_Dropped                                        = 1,
	EPO_Retrieved                                      = 2,
	EPO_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class sfxgamempcontent.sfxgawreinforcementmanager
// 0x0114 (0x0150 - 0x003C)
class Usfxgawreinforcementmanager : public USFXGAWReinforcementManagerBase
{
public:
	TArray< struct FCardPackEntry >                    PackList;                                         		// 0x003C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FStoreInfoEntry >                   StoreInfoArray;                                   		// 0x0048 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FConsumableToPackEntry >            ConsumableIdPackNameMap;                          		// 0x0054 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     CardData;                                         		// 0x0060 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     LastAwardedCards;                                 		// 0x006C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     AwardedCards;                                     		// 0x0078 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     LastAwardedPackName;                              		// 0x0084 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     ManualAwardedCards;                               		// 0x0090 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ManualAwardedPackName;                            		// 0x009C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class Usfxgawreinforcementmatchconsumable* > MatchConsumables;                                 		// 0x00A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class USFXGAWReinforcementBase* >          Deck;                                             		// 0x00B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FBWConsumableInfo >                 OutstandingConsumableIDs;                         		// 0x00C0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UClass* >                            KnownConsumableTypes;                             		// 0x00CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sCachedDataBaseKey;                               		// 0x00D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnPurchaseItemDelegate__Delegate;               		// 0x00E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnProcessConsumablesDelegate__Delegate;         		// 0x00F0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnPurchaseItemWithCreditsDelegate__Delegate;    		// 0x00FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __CardSort__Delegate;                             		// 0x0108 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __MatchConsumableSort__Delegate;                  		// 0x0114 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __StoreItemSort__Delegate;                        		// 0x0120 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                ConsumptionFlowResult;                            		// 0x012C (0x0004) [0x0000000000000000]              
	int                                                fTimeoutRefreshDigitalRights;                     		// 0x0130 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                fTimeoutRefreshMPSaves;                           		// 0x0134 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                fTimeoutConsumeID;                                		// 0x0138 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                fTimeoutSaveMPRecord;                             		// 0x013C (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FBWEntitlementId                            PackPurchasedEntitlement;                         		// 0x0140 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                nTestConsumptionError;                            		// 0x0144 (0x0004) [0x0000000000000000]              
	class USFXSaveManagerMP*                           SaveManager;                                      		// 0x0148 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bFetchingProductDetails : 1;                      		// 0x014C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bRetryProcessConsumables : 1;                     		// 0x014C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bProcessConsumableCriticalError : 1;              		// 0x014C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bCreditPurchaseRetry : 1;                       		// 0x014C (0x0004) [0x0000000000000000] [0x00000008] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 105408 ];

		return pClassPointer;
	};

	bool CanAffordNewStoreItems ( int OldCredits, int NewCredits );
	struct FString GetPCPointsBalance ( );
	int GetOfferIDFromStoreID ( int StoreID );
	int GetStoreItemIDFromOffer ( int offerId );
	void ConsumptionFlow_Finished ( int nResult );
	void ExitConsumptionFlow ( );
	void FinishPurchase ( int nResult );
	void AwardPacks ( int nID, int nCopies );
	void UpdateLastAwardedCards ( );
	void ConsumptionFlow_SaveComplete ( int nResult );
	void ConsumptionFlow_ProcessRemote ( );
	void GrantPackPurchasedEntitlement ( );
	void ConsumptionFlow_ProcessLocal ( struct FBWConsumableId Id, int nCopies, int nResult );
	void ConsumptionFlow_Top ( int nResult );
	void StartConsumptionFlow ( unsigned long bRefreshSave );
	void ConsumptionFlow_Setup ( int nResult );
	void ProcessConsumables ( struct FScriptDelegate ConsumeCallback, unsigned long bRetry );
	bool ConsumptionFlow_ClearCallbackTimer ( );
	bool ConsumptionFlow_SetCallbackTimer ( float fTime );
	void ConsumptionFlow_Timer ( );
	void ConsumptionFlowError ( struct FString sMsg, unsigned long bAbortFlow, unsigned long bWipeSave );
	bool PurchaseItemFromPlatform ( int ItemId, struct FScriptDelegate PurchaseCallback );
	bool CanPurchaseItemWithCredits ( int ItemId );
	void ReloadPlayerSettingsComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void OnPurchaseItemWithCreditsFinished ( int nResult );
	void PurchaseItemWithCredits ( int ItemId, struct FScriptDelegate SaveRecordsCallback );
	bool EntitlementVisiblityCheck ( struct FVisibleCondition* visible, TArray< struct FBWEntitlementInfo >* Entitlements );
	bool CheckOfferVisibility ( struct FStoreInfoEntry* StoreItem, TArray< struct FBWEntitlementInfo >* Entitlements );
	int FindOfferIndex ( int nOfferID, TArray< struct FBWOfferInfo >* Offers );
	unsigned char GetStoreItemPurchaseType ( struct FString FirstPartyPrice, struct FStoreInfoEntry* StoreItem );
	int GetPlatformCostValue ( int ItemId );
	struct FString GetPlatformCost ( int ItemId );
	int GetCreditCost ( int ItemId );
	int StoreItemSort ( struct FStoreGUIData Entry_A, struct FStoreGUIData Entry_B );
	TArray< struct FStoreGUIData > GetStoreItems ( );
	TArray< struct FStoreInfoEntry > GetStoreInfo ( );
	bool IsFetchingProductDetails ( );
	void GetProductDetailsComplete ( );
	bool UpdateStoreDescriptions ( );
	int MatchConsumableSort ( struct FCardInfoData ItemA, struct FCardInfoData ItemB );
	class Usfxgawreinforcementmatchconsumable* GetUniqueMatchConsumables ( );
	TArray< struct FCardInfoData > GiveCardPack ( struct FString PackName, int nConsumableId );
	int AwardRandomCardsFromPoolCards ( struct FString PoolName, int Quantity, unsigned long AllowDupes, TArray< struct FCardInfoData >* ChosenCards );
	bool PopulateCardData ( struct FCardInfoData* Card );
	TArray< class USFXGAWReinforcementBase* > GetCardsOfType ( struct FString PoolName );
	int CardSort ( class USFXGAWReinforcementBase* CardA, class USFXGAWReinforcementBase* CardB );
	void LoadDeck ( );
	void OnPurchaseItemWithCreditsDelegate ( int nResult );
	void OnProcessConsumablesDelegate ( int nResult );
	void OnPurchaseItemDelegate ( int nResult );
};

UClass* Usfxgawreinforcementmanager::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementBase
// 0x0028 (0x0064 - 0x003C)
class USFXGAWReinforcementBase : public UObject
{
public:
	struct FString                                     PoolName;                                         		// 0x003C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FCardInfoData >                     CardList;                                         		// 0x0048 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< int >                                      RequiredDLCModuleIDs;                             		// 0x0054 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class Usfxgawreinforcementmanager*                 GAWManager;                                       		// 0x0060 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 105467 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementBase::pClassPointer = NULL;

// Class sfxgamempcontent.BioStartLocationMP
// 0x0006 (0x01FC - 0x01F6)
class ABioStartLocationMP : public AActor
{
public:
	unsigned long                                      bPrimaryStart : 1;                                		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 105475 ];

		return pClassPointer;
	};

};

UClass* ABioStartLocationMP::pClassPointer = NULL;

// Class sfxgamempcontent.sfxgawreinforcementmatchconsumable
// 0x000C (0x0070 - 0x0064)
class Usfxgawreinforcementmatchconsumable : public USFXGAWReinforcementBase
{
public:
	TArray< struct FDescriptionTokens >                TokensList;                                       		// 0x0064 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107626 ];

		return pClassPointer;
	};

	struct FString TrimTrailingZeroes_NoGear ( struct FString S, unsigned long KeepDecimal );
	struct FString FloatToString_NoGear ( float F );
	struct FString FloatToPercentString_NoGear ( float F );
	struct FDescriptionTokens FindDescriptionTokens_NoGear ( struct FString CardUniqueName );
	void PrepareCustomTokensForDescription ( struct FString CardUniqueName );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetSlotTypeForCategory ( int Category );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
	bool IsActive ( int UniqueId, float VersionIdx );
	bool ContainsCard ( int UniqueId, float VersionIdx );
	int FindCardIndexFromID ( int UniqueId, float VersionIdx );
	class Asfxpri* GetPRI ( );
};

UClass* Usfxgawreinforcementmatchconsumable::pClassPointer = NULL;

// Class sfxgamempcontent.sfxtelemetryhooksmp
// 0x0000 (0x00B0 - 0x00B0)
class Usfxtelemetryhooksmp : public Usfxtelemetryhooks
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107720 ];

		return pClassPointer;
	};

	void SendCachedDisconnectEvent ( );
	void SendLanguageOverrideSettings ( );
	struct FGuid eventGetCharacterID ( class ABioPawn* Pawn );
	void SendProfileDependentTelemetry ( unsigned char LocalUserNum );
	void SendTelemetryOnProfileReadComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void OnLoginChange ( unsigned char LocalUserNum );
	void OnAuthenticate ( );
	void eventInitConnectionDelegates ( );
	void OnDisconnect ( int Error, int PreviousState, int NewState, struct FString SessionId );
	bool IsCollectionEnabled ( );
	void AddAttributeToArray ( unsigned char Type, struct FString Key, int nData, float fData, unsigned long bData, struct FName nmData, TArray< struct FTelemetryAttribute >* Attributes, struct FString* sData );
	void SendAchievement ( int AchievementId );
	struct FString GenerateUniqueClassId ( class UObject* Object );
	struct FString GenerateUniqueClassIdFromString ( struct FString* FullFriendlyName );
	int FStringToFourCC ( struct FString* s4CharID );
	void SendArray ( struct FName HookName, TArray< struct FTelemetryAttribute > Attributes );
	void SendBool ( struct FName HookName, unsigned long B );
	void SendFloat ( struct FName HookName, float F );
	void SendInt ( struct FName HookName, int i );
	void SendString ( struct FName HookName, struct FString S );
	void SendName ( struct FName HookName, struct FName N );
	void SendVoid ( struct FName HookName );
	class USFXTelemetryGameSession* GetInstanceGameSession ( );
};

UClass* Usfxtelemetryhooksmp::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementInGameConsumable
// 0x0000 (0x0064 - 0x0064)
class USFXGAWReinforcementInGameConsumable : public USFXGAWReinforcementBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107955 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementInGameConsumable::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementInventoryUnlock
// 0x0000 (0x0064 - 0x0064)
class USFXGAWReinforcementInventoryUnlock : public USFXGAWReinforcementBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107956 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementInventoryUnlock::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementMatchConsumable_NonGameplay
// 0x0000 (0x0070 - 0x0070)
class USFXGAWReinforcementMatchConsumable_NonGameplay : public Usfxgawreinforcementmatchconsumable
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107957 ];

		return pClassPointer;
	};

	struct FString TrimTrailingZeroes_NoGear ( struct FString S, unsigned long KeepDecimal );
	struct FString FloatToString_NoGear ( float F );
	struct FString FloatToPercentString_NoGear ( float F );
	struct FDescriptionTokens FindDescriptionTokens_NoGear ( struct FString CardUniqueName );
	void PrepareCustomTokensForDescription ( struct FString CardUniqueName );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetSlotTypeForCategory ( int Category );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
	bool IsActive ( int UniqueId, float VersionIdx );
	bool ContainsCard ( int UniqueId, float VersionIdx );
	int FindCardIndexFromID ( int UniqueId, float VersionIdx );
	class Asfxpri* GetPRI ( );
};

UClass* USFXGAWReinforcementMatchConsumable_NonGameplay::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementPermanentUpgrade
// 0x0000 (0x0064 - 0x0064)
class USFXGAWReinforcementPermanentUpgrade : public USFXGAWReinforcementBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107958 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementPermanentUpgrade::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementUnsaved
// 0x0000 (0x0064 - 0x0064)
class USFXGAWReinforcementUnsaved : public USFXGAWReinforcementBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107960 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementUnsaved::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementCredits
// 0x0000 (0x0064 - 0x0064)
class USFXGAWReinforcementCredits : public USFXGAWReinforcementUnsaved
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107959 ];

		return pClassPointer;
	};

	void ConsumeNonGameplayConsumable ( struct FName UniqueName, int VersionIdx );
	void GenerateCardUniqueID ( int idx );
	int GetCardUniqueID ( int idx );
	struct FName GetPlayerVariableNameFromCard ( struct FCardInfoData* Card );
	struct FName GetPlayerVariableName ( int idx );
	int GetCurrentCount ( int SearchUniqueID, int VersionIdx );
	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
	void SetCurrentValue ( struct FName VarName, int Value );
	int GetCurrentValue ( struct FName VarName );
	void Initialize ( );
	bool IsActive ( int UniqueId, float VersionIdx );
	void Deactivate ( int UniqueId, float VersionIdx );
	void Activate ( int UniqueId, float VersionIdx );
};

UClass* USFXGAWReinforcementCredits::pClassPointer = NULL;

// Class sfxgamempcontent.SFXGAWReinforcementKitUnlock
// 0x000C (0x0070 - 0x0064)
class USFXGAWReinforcementKitUnlock : public USFXGAWReinforcementBase
{
public:
	TArray< int >                                      XPBonus;                                          		// 0x0064 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107961 ];

		return pClassPointer;
	};

	bool OnAwarded ( struct FCardInfoData* CardInfoOut, TArray< struct FCardInfoData >* ChosenCards );
};

UClass* USFXGAWReinforcementKitUnlock::pClassPointer = NULL;

// Class sfxgamempcontent.sfxcheatmanagernonnativemp
// 0x000C (0x0170 - 0x0164)
class Usfxcheatmanagernonnativemp : public Ubiocheatmanagernonnative
{
public:
	TArray< struct FString >                           DisplayPools;                                     		// 0x0164 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107962 ];

		return pClassPointer;
	};

	void SetEmblem ( int nEmblemID );
	void KickServer ( );
	void EndCurrentWave ( );
	void ToggleEndlessWave ( );
	void ProfileMPGame ( );
	void PlayObjectiveLine ( struct FString EventName, int ObjectiveIndex, int LineIndex );
	void PlayHordeLine ( struct FString EventName, int Index );
	void SkipWave ( );
	void RestartWithFaction ( struct FString Faction );
	void RestartFromBeginning ( );
	void RestartFromCheckpoint ( );
	void RestartFromWave ( int nWave );
	void ShowAllMPCards ( );
	void TestPurchaseEntitlement ( );
	void TestConsumptionError ( int nCriticalLocation );
	void TestPurchaseFromPlatform ( int nID );
	void UnlockAllMPCards ( );
	void ReplicationDebugCam ( );
	void TestSquads ( );
	void TestHostile ( );
	void GiveMPConsumables ( int Quantity );
	void GiveShieldConsumable ( int Quantity );
	void GiveRocketConsumable ( int Quantity );
	void GiveReviveConsumable ( int Quantity );
	void GiveAmmoConsumable ( int Quantity );
	void GiveAllMatchConsumables ( );
	void DebugMatchConsumables ( );
	void LoadDeck ( );
	void CheatCardPack ( struct FString PackName );
	void CreditsCardPack ( struct FString PackName );
	void ProfileDeck ( );
	void SetKit ( struct FString KitName );
};

UClass* Usfxcheatmanagernonnativemp::pClassPointer = NULL;

// Class sfxgamempcontent.sfxprimp
// 0x02A5 (0x0679 - 0x03D4)
class Asfxprimp : public Asfxpri
{
public:
	struct FUniqueNetId                                KickVotePlayerId;                                 		// 0x03D4 (0x0008) [0x0000000000000020]              ( CPF_Net )
	struct FMPCharacterData                            CharacterData;                                    		// 0x03DC (0x0048) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )
	struct FString                                     ComputerName;                                     		// 0x0424 (0x000C) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )
	struct FString                                     DisplayName;                                      		// 0x0430 (0x000C) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )
	TArray< float >                                    XPBonusMultipliers;                               		// 0x043C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FString >                           DefaultLoadClasses;                               		// 0x0448 (0x000C) [0x0000000000404002]              ( CPF_Const | CPF_Config | CPF_NeedCtorLink )
	struct FString                                     DEFAULT_PLAYER_ARCHETYPE_PATH;                    		// 0x0454 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< struct FMapConfigData >                    MapSettings;                                      		// 0x0460 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FEmblemDisplayInfo >                EmblemList;                                       		// 0x046C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FScriptDelegate                             __PRITotalPointSort__Delegate;                    		// 0x0478 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FMPPowerData                                CharacterPowers[ 0x6 ];                           		// 0x0484 (0x00D8) [0x0000000000000020]              ( CPF_Net )
	struct FMPWeaponData                               CharacterWeapons[ 0x2 ];                          		// 0x055C (0x0038) [0x0000000000000020]              ( CPF_Net )
	int                                                PlayerMedals[ 0xA ];                              		// 0x0594 (0x0028) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	int                                                PlayerMedalsCache[ 0xA ];                         		// 0x05BC (0x0028) [0x0000000000002000]              ( CPF_Transient )
	struct FLinearColor                                NametagColor;                                     		// 0x05E4 (0x0010) [0x0000000000000000]              
	struct FName                                       ActiveXPBonusMultiplierPV;                        		// 0x05F4 (0x0008) [0x0000000000000000]              
	struct FName                                       DEFAULT_PLAYER_KIT;                               		// 0x05FC (0x0008) [0x0000000000000002]              ( CPF_Const )
	struct FName                                       MatchConsumableGECategory;                        		// 0x0604 (0x0008) [0x0000000000000000]              
	class Asfxpawn*                                    sfxpawn;                                          		// 0x060C (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              EndOfMatchScreenDisplayTime;                      		// 0x0610 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                LobbyListOrder;                                   		// 0x0614 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              MaxReadinessXPBonus;                              		// 0x0618 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class AController*                                 m_pControllerOfLastClientInitialize;              		// 0x061C (0x0004) [0x0000000000000000]              
	float                                              GlobalZoneIncrease;                               		// 0x0620 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              RandomGlobalZoneIncrease;                         		// 0x0624 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ScaledGlobalZoneIncrease;                         		// 0x0628 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ScaledMapZoneIncrease;                            		// 0x062C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ScaledRandomGlobalZoneIncrease;                   		// 0x0630 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                NumConsumablesAllowedPerMatch;                    		// 0x0634 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      ReadyInLobby : 1;                                 		// 0x0638 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      StoreIsOpen : 1;                                  		// 0x0638 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      ReadyToTransitionToLobby : 1;                     		// 0x0638 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bEndOfMatchRecordsSaved : 1;                      		// 0x0638 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bEndOfMatchRatingsUpdated : 1;                    		// 0x0638 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bEndOfMatchScreenShownForLongEnough : 1;          		// 0x0638 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bSaveRecordSet : 1;                               		// 0x0638 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bReplicationReady : 1;                            		// 0x0638 (0x0004) [0x0000000000000020] [0x00000080] ( CPF_Net )
	unsigned long                                      bIsReplicationValid_CharacterPowers : 1;          		// 0x0638 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      bIsReplicationValid_CharacterWeapons : 1;         		// 0x0638 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bWaitingForPawn : 1;                              		// 0x0638 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bLocalMapsSent : 1;                               		// 0x0638 (0x0004) [0x0000000000000020] [0x00000800] ( CPF_Net )
	unsigned char                                      LocalMapArray[ 0x1E ];                            		// 0x063C (0x001E) [0x0000000000000000]              
	unsigned char                                      CombinedMapArray[ 0x1E ];                         		// 0x065A (0x001E) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      NumKickVotesReceived;                             		// 0x0678 (0x0001) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107967 ];

		return pClassPointer;
	};

	void* GetPlayerChallengeTitle ( );
	struct FEmblemDisplayInfo GetCurrentEmblemData ( );
	struct FEmblemDisplayInfo GetEmblemData ( int EmblemID );
	void SendTelemetryForWeapons ( );
	bool GetStoreIsOpen ( );
	void ServerSetStoreIsOpen ( unsigned long NewStoreIsOpen );
	void SetStoreIsOpen ( unsigned long NewStoreIsOpen );
	void ServerSetReadyToTransitionToLobby ( unsigned long bReady );
	void ServerSetKickVote ( struct FUniqueNetId KickVote );
	void SetKickVote ( struct FUniqueNetId KickVote );
	void ServerSetMapArray ( unsigned char* MapArray );
	void OnPlayerMedalsChanged ( unsigned long bDisplay );
	void AddPlayerMedal ( int Medal, int ReplaceMedal, unsigned long bDisplay );
	void DisplayPlayerMedal ( int nMedal );
	void ApplyMatchConsumableGameEffects ( class ASFXPawn_Player* pPawn );
	bool VerifyPawnPowers ( class ASFXPawn_Player* Pawn );
	bool IsMatchConsumableActive ( int UniqueConsumableID, float Value );
	void ClearActiveMatchConsumables ( );
	void GetAppearanceData ( int* Tint1ID, int* Tint2ID, int* PatternID, int* PatternColorID, int* PhongID, int* EmissiveID, int* SkinToneID );
	void GetCharacterData_Patch ( int* NumClassPromotions, int* EmblemID, int* ChallengePoints );
	void SetCharacterData_Patch ( int NumClassPromotions, int EmblemID, int ChallengePoints );
	void GetCharacterData ( struct FString* CharacterName, struct FName* CharacterKit, void** ClassPrettyName, int* Level, float* XP, int* n7Rating );
	void SetCharacterData ( struct FString CharacterName, struct FName CharacterKit, void* ClassPrettyName, int Level, float XP, int n7Rating );
	void SetAppearanceData ( int Tint1ID, int Tint2ID, int PatternID, int PatternColorID, int PhongID, int EmissiveID, int SkinToneID );
	void SetCharacterName ( struct FString CharacterName );
	struct FName GetCharacterKit ( );
	void SetCharacterKit ( struct FName CharacterKit );
	bool GetPower ( int PowerIndex, struct FName* PowerClassPath, int* EvolvedChoices, int* CurrentRank );
	bool SetPower ( int PowerIndex, struct FName PowerClassPath, int* EvolvedChoices, int CurrentRank );
	void ClearPowerData ( );
	bool GetWeaponMod ( int WeaponIndex, int ModIndex, struct FName* WeaponModClassPath, int* WeaponModLevel );
	bool SetWeaponMod ( int WeaponIndex, int ModIndex, struct FName WeaponModClassPath, int WeaponModLevel );
	int GetWeaponLevel ( struct FName WeaponClassPath );
	bool GetWeapon ( int WeaponIndex, struct FName* WeaponClassPath );
	void SetWeapon ( int WeaponIndex, struct FName WeaponClassPath, int WeaponLevel );
	void ClearWeaponData ( );
	unsigned char GetAsyncLoadingStatus ( );
	struct FString GetPawnArchetype ( );
	class APawn* GetAPawn ( );
	void NotifyPawnCharacterChanged ( );
	void OnCharacterChanged ( );
	void SendCharacterDataToServer ( unsigned long bCharacter, unsigned long bWeapon, unsigned long bPower );
	void UnregisterPlayerFromSession ( );
	void CopyProperties ( class APlayerReplicationInfo* PRI );
	int PRITotalPointSort ( class Asfxprimp* A, class Asfxprimp* B );
	void EndOfMatchScreenFinished ( );
	void OnUpdatedRankingsComplete ( int nResult );
	void OnSaveRecordsComplete ( int nResult );
	void GatherMatchResults ( unsigned long bMatchWin, int* ExtractedPlayers );
	void GetZoneIncreases ( unsigned long bRandomMap, int Wave, int Map, float* ZoneIncrease, float* OverallIncrease );
	void GrantCredits ( int nCredits );
	void GrantXP ( float fXP );
	void SetReadyToPlay ( unsigned long NewReadyState );
	void ServerSetReadyInLobby ( unsigned long NewReadyState );
	void SetReadyInLobby ( unsigned long NewReadyState );
	bool CanSetReadyInLobby ( );
	bool IsReadyInLobby ( );
	void LoadWeaponDataFromSave ( class Usfxmpcharacterrecord* Character );
	void LoadPowerDataFromSave ( class Usfxmpcharacterrecord* Character );
	void LoadDataFromSave ( class Usfxmpcharacterrecord* Character );
	bool ShouldBroadCastWelcomeMessage ( unsigned long bExiting );
	void ServerSetPowerSelection ( struct FMPPowerData* Data );
	void ServerSetWeaponSelection ( struct FMPWeaponData* Data );
	void ServerSetCharacterSelection ( struct FMPCharacterData Data );
	void ServerSetComputerName ( struct FString sComputerName );
	void SetComputerName ( struct FString sComputerName );
	void TriggerNewScoreTag ( int Amount, struct FString Message );
	bool IsAI ( );
	bool IsPlayer ( );
	void SetPawn ( class Asfxpawn* P );
	void eventReplicatedEvent ( struct FName VarName );
	void ServerSetReplicationReady ( );
	void SetReplicationReady ( );
	class Asfxlobbyflow* GetLobbyFlow ( );
	void BuildLocalMapArray ( TArray< struct FMPMapInfo > AvailableMaps );
	void PostBeginPlay ( );
};

UClass* Asfxprimp::pClassPointer = NULL;

// Class sfxgamempcontent.SFXWave_Horde
// 0x00EC (0x0148 - 0x005C)
class USFXWave_Horde : public Usfxwave
{
public:
	TArray< struct FEnemySpawnInfo >                   EnemyList;                                        		// 0x005C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FPetData >                          PetList;                                          		// 0x0068 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FEnemySquadInfo >                   EnemySquadList;                                   		// 0x0074 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FBerserkStartCount >                BerserkStartCounts;                               		// 0x0080 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FDifficultyLevelEnemies >           Enemies;                                          		// 0x008C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< int >                                      Squads;                                           		// 0x0098 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSpawnedEnemy >                     EnemiesSpawned;                                   		// 0x00A4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      AliveEnemiesByType;                               		// 0x00B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      NumSpawnedEnemiesByType;                          		// 0x00BC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              SpawnDelay;                                       		// 0x00C8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                WaveIndex;                                        		// 0x00CC (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                WavePoints;                                       		// 0x00D0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SquadChance;                                      		// 0x00D4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                MinPlayersToSpawnSquad;                           		// 0x00D8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class ABioBaseSquad*                               EnemySquad;                                       		// 0x00DC (0x0004) [0x0000000000000000]              
	int                                                CurrentWave;                                      		// 0x00E0 (0x0004) [0x0000000000000000]              
	int                                                WavePointsRemaining;                              		// 0x00E4 (0x0004) [0x0000000000000000]              
	int                                                CurrentSquadIndex;                                		// 0x00E8 (0x0004) [0x0000000000000000]              
	int                                                NextSquadEnemyIndex;                              		// 0x00EC (0x0004) [0x0000000000000000]              
	class ANavigationPoint*                            LastEnemyNavPoint;                                		// 0x00F0 (0x0004) [0x0000000000000000]              
	class ASFXEnemySpawnPoint*                         CurrentEnemySpawnPoint;                           		// 0x00F4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CurrentEnemySpawnPointCount;                      		// 0x00F8 (0x0004) [0x0000000000000000]              
	int                                                MaxEnemiesPerSpawnPoint;                          		// 0x00FC (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                MaxEnemies;                                       		// 0x0100 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srWaveNumber;                                     		// 0x0104 (0x0004) [0x0000000000000002]              ( CPF_Const )
	void*                                              SrEnemiesAlive;                                   		// 0x0108 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              SpawnPenaltyOnTop;                                		// 0x010C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnPenaltyLineOfSight;                          		// 0x0110 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnPenaltyLineOfSightMaxDist;                   		// 0x0114 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnDistancePenaltyClose;                        		// 0x0118 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnRandomVariance;                              		// 0x011C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnDesignerWeightMultiplier;                    		// 0x0120 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnDistanceClose;                               		// 0x0124 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnBaseRating;                                  		// 0x0128 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpawnMinRatingForRespawn;                         		// 0x012C (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                EnemiesRemainingToActivateObjective;              		// 0x0130 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              EnemyObjectiveMarkerDelay;                        		// 0x0134 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                DamageReductionTimerOnSpawnIn;                    		// 0x0138 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              EndOfRoundSpeedBonus;                             		// 0x013C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              WavePointsToBudget;                               		// 0x0140 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      EndlessWave : 1;                                  		// 0x0144 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bEndRushTriggered : 1;                            		// 0x0144 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      DisplayObjectivesForAllEnemies : 1;               		// 0x0144 (0x0004) [0x0000000000004000] [0x00000004] ( CPF_Config )
	unsigned long                                      bWaveIsOver : 1;                                  		// 0x0144 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 108035 ];

		return pClassPointer;
	};

	void StartAutoBots ( );
	float GetScoreBudget ( );
	int CalculateSpawnedEnemyCost ( );
	void PawnRevived ( class ABioPawn* Pawn );
	struct FEnemySpawnInfo GetEnemySpawnInfoForEnemyType ( struct FName EnemyType );
	void StopSpawningNewEnemies ( );
	void SetEndlessWaves ( unsigned long Endless );
	bool EnemyBudgetRemaining ( );
	int GetCreatureWaveCost ( class APawn* P );
	void TriggerWaveEndEvent ( int Wave );
	void TriggerEnemyKilledEvent ( class APawn* Killed, class APawn* Killer );
	void TriggerWaveStartEvent ( int Wave );
	bool ShouldSpawnSquad ( );
	int GetPlayerCount ( );
	void PawnDied ( class ABioPawn* Pawn, class ABioPawn* Killer );
	void ActivateEnemyObjectiveMarkers ( );
	void UpdateObjectiveStatus ( );
	void SpawnHorde ( );
	void SpawnEnemy ( int Index );
	bool AreRemainingEnemiesOnMyTeam ( );
	int ChooseEnemyToSpawn ( );
	bool ChooseSquadToSpawn ( );
	bool CanEnemyUseSpawnPoint ( class UClass* EnemyClass, float EnemyRadius, float EnemyHeight, class ANavigationPoint* NavPoint );
	float RateEnemyStart ( class ANavigationPoint* NavPoint, float EnemyRadius, float EnemyHeight, class UClass* EnemyClass, unsigned long bDoTraceCheck );
	class ANavigationPoint* ChooseEnemyStart ( class UClass* EnemyClass );
	void FinishWave ( );
	bool BeginWave ( );
	void GetEnemyArray ( TArray< struct FEnemyWaveInfo >* EnemyArray );
	void InitializeWave ( class ASFXWaveManager* OwnerManager );
};

UClass* USFXWave_Horde::pClassPointer = NULL;

// Class sfxgamempcontent.SFXSquadCombatMP
// 0x0000 (0x0228 - 0x0228)
class ASFXSquadCombatMP : public ABioBaseSquad
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 108037 ];

		return pClassPointer;
	};

	void NotifyCombatZoneRemoved ( );
	void NotifyCombatZoneAdded ( );
	void eventDisableSquad ( );
	void eventEnableSquad ( );
	class ABioBaseSquad* MakeHackable ( );
	void eventMemberRemoved ( class APawn* oPawn );
	void RemoveDyingMember ( class APawn* oPawn );
	int eventAddMember ( class APawn* Pawn, unsigned long bCheckPlaypens );
	bool Died ( class APawn* member, class AController* Killer );
	void NotifyPlaypenChanged ( );
	void eventNotifyNoEnemiesPerceived ( );
	void eventNotifyEnemyPerceived ( );
	bool GetClosestCombatZoneOrigin ( struct FVector Position, struct FVector* Origin );
	bool IsPositionInCombatZone ( struct FVector Position );
	bool IsCoverInCombatZone ( class ACoverSlotMarker* SlotMarker );
	bool HasCombatZone ( class ASFXCombatZone* CombatZone );
	void RemoveCombatZone ( class ASFXCombatZone* CombatZone );
	void AddCombatZone ( class ASFXCombatZone* CombatZone );
	class AActor* GetPlaypenReturnPoint ( class APawn* oPawn );
	class AActor* GetPlaypenNavOrigin ( class APawn* oPawn );
	void UpdatePlaypen ( );
	bool IsVolumeInPlaypen ( class ABioPlaypenVolume* Volume );
	void RemoveVolumeFromPlaypen ( class ABioPlaypenVolume* Volume );
	void AddVolumeToPlaypen ( class ABioPlaypenVolume* Volume );
	bool HasPlaypen ( );
	bool IsActorInSubtractivePlaypen ( class AActor* oActor );
	bool IsActorInPlaypen ( class AActor* oActor );
	bool IsPositionInSubtractivePlaypen ( struct FVector* vLocation );
	bool IsPositionInPlaypen ( struct FVector* vLocation );
	void SquadMembers ( class ABioAiController** oController );
	void SetMemberMoveIndicator ( int nIndex, class ABioTacticalMoveToIndicator* oIndicator );
	class ABioTacticalMoveToIndicator* GetMemberMoveIndicator ( int nIndex );
	bool RemoveMember ( class APawn* pPawn );
};

UClass* ASFXSquadCombatMP::pClassPointer = NULL;

// Class sfxgamempcontent.SFXPlayerSquadMP
// 0x0008 (0x0230 - 0x0228)
class ASFXPlayerSquadMP : public ABioBaseSquad
{
public:
	class Asfxpawn_playermp*                           LeaderPawn;                                       		// 0x0228 (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	class Asfxpawn_playermp*                           LocalPawn;                                        		// 0x022C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 108039 ];

		return pClassPointer;
	};

	int eventAddMember ( class APawn* Pawn, unsigned long bCheckPlaypens );
	void RemoveDyingMember ( class APawn* oPawn );
	void eventPostBeginPlay ( );
};

UClass* ASFXPlayerSquadMP::pClassPointer = NULL;

// Class sfxgamempcontent.sfxplayercontrollermp
// 0x0080 (0x0C1C - 0x0B9C)
class Asfxplayercontrollermp : public Asfxplayercontroller
{
public:
	TArray< struct FName >                             MPMapNames;                                       		// 0x0B9C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnWeaponSelectFinishedDelegate__Delegate;       		// 0x0BA8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FViewTargetTransitionParams                 VTTransParms;                                     		// 0x0BB4 (0x0010) [0x0000000000000000]              
	struct FVector                                     AFKLastMoveStick;                                 		// 0x0BC4 (0x000C) [0x0000000000000000]              
	class Usfxgui_mpstore*                             StoreGUI;                                         		// 0x0BD0 (0x0004) [0x0000000000000000]              
	class USFXGUI_SquadRecord*                         LevelUpGUI;                                       		// 0x0BD4 (0x0004) [0x0000000000000000]              
	class Asfxlobbyflow*                               LobbyFlow;                                        		// 0x0BD8 (0x0004) [0x0000000000000000]              
	class ABioStartLocationMP*                         BioStartSpot;                                     		// 0x0BDC (0x0004) [0x0000000000000000]              
	float                                              CountdownTimerEndTime;                            		// 0x0BE0 (0x0004) [0x0000000000000000]              
	float                                              CountdownTimerLeeway;                             		// 0x0BE4 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              TickSaveGameInterval;                             		// 0x0BE8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srWaitMessageMatchStarted;                        		// 0x0BEC (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srWaitMessageMatchEnded;                          		// 0x0BF0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srWaitMessageGeneric;                             		// 0x0BF4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srExitMessage;                                    		// 0x0BF8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srExitMessageLobby;                               		// 0x0BFC (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srConfirm;                                        		// 0x0C00 (0x0004) [0x0000000000004000]              ( CPF_Config )
	void*                                              srCancel;                                         		// 0x0C04 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              AFKTimeLimitSeconds;                              		// 0x0C08 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                AFKTickTime;                                      		// 0x0C0C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              AFKPostponementStartTime;                         		// 0x0C10 (0x0004) [0x0000000000000000]              
	float                                              AFKLastActionTime;                                		// 0x0C14 (0x0004) [0x0000000000000000]              
	unsigned long                                      bReceivedPlayer : 1;                              		// 0x0C18 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bFinishedTraveling : 1;                           		// 0x0C18 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bIsJoinInProgress : 1;                            		// 0x0C18 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bRestarting : 1;                                  		// 0x0C18 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      AFKIgnoreMovementCheck : 1;                       		// 0x0C18 (0x0004) [0x0000000000004000] [0x00000010] ( CPF_Config )
	unsigned long                                      AFKIgnoreWeaponAndPowerCheck : 1;                 		// 0x0C18 (0x0004) [0x0000000000004000] [0x00000020] ( CPF_Config )
	unsigned long                                      IsAFKPostponementActive : 1;                      		// 0x0C18 (0x0004) [0x0000000000000000] [0x00000040] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 108052 ];

		return pClassPointer;
	};

	void Internal_ResetPlayerController ( struct FVector NewLocation );
	void eventSwitchWeapon ( class ASFXWeapon_NativeBase* oWpn );
	void AFK ( );
	void SetAFKLastActionTime ( unsigned long isMovementCheck );
	void DoAFKTick ( );
	void BackToMainMenu ( unsigned long bAPressed, int Context );
	bool CheckIfConnectedFailsafe ( );
	void QuickLoad ( );
	void ClientShowExtractionCredits ( float Credits );
	void eventClientPlaySimpleDialogLine ( void* DialogLineSr, class AActor* DialogPlayerOwner );
	void InternalSawNewEnemy ( class ABioPawn** EnemyPawn );
