/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: sfxgamecontent_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_SHOTGUN_SMOOTHING_BUFFER                           3

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class sfxgamecontent.sfxprojectile_powercustomaction_seeking
// 0x0041 (0x0465 - 0x0424)
class Asfxprojectile_powercustomaction_seeking : public ASFXProjectile_PowerCustomAction
{
public:
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0424 (0x000C) MISSED OFFSET
	struct FQuat                                       StartRotation;                                    		// 0x0430 (0x0010) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     LastValidSeekLocation;                            		// 0x0440 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              TimeAlive;                                        		// 0x044C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              CurveShape;                                       		// 0x0450 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              UpperBound;                                       		// 0x0454 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              InterpRate;                                       		// 0x0458 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              PawnEvadedStopSeekingTime;                        		// 0x045C (0x0004) [0x0000000000000000]              
	unsigned long                                      bSeekingEnabled : 1;                              		// 0x0460 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bExplodeNextFrame : 1;                            		// 0x0460 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bPawnEvaded : 1;                                  		// 0x0460 (0x0004) [0x0000000000002020] [0x00000004] ( CPF_Net | CPF_Transient )
	unsigned char                                      SeekAimNode;                                      		// 0x0464 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106343 ];

		return pClassPointer;
	};

	void Tick_Prediction ( float DeltaTime );
	void Recycle ( );
	void InitializeRotation ( class APawn* oCasterPawn );
	bool InitializePowerProjectile ( class AActor* oCaster, float fTravelSpeed, float fRadius, class Usfxpowercustomaction* oPower );
	void PawnEvadedPower ( class ABioPawn* Pawn, struct FName Label, float TimeBeforeImpact );
	bool CanLockOn ( class AActor* Target, class APawn* CasterPawn );
	void Tick ( float DeltaTime );
	void TickAimRotation ( float DeltaTime, struct FVector SeekVector );
	void TickAim ( float DeltaTime );
	struct FVector GetAimLocation ( class AActor* Target );
	void Timer ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* Asfxprojectile_powercustomaction_seeking::pClassPointer = NULL;

// Class sfxgamecontent.SFXProjectile_PowerCustomAction_SentryTurretRocket
// 0x0000 (0x0465 - 0x0465)
class ASFXProjectile_PowerCustomAction_SentryTurretRocket : public Asfxprojectile_powercustomaction_seeking
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106025 ];

		return pClassPointer;
	};

	void Tick_Prediction ( float DeltaTime );
	void Recycle ( );
	void InitializeRotation ( class APawn* oCasterPawn );
	bool InitializePowerProjectile ( class AActor* oCaster, float fTravelSpeed, float fRadius, class Usfxpowercustomaction* oPower );
	void PawnEvadedPower ( class ABioPawn* Pawn, struct FName Label, float TimeBeforeImpact );
	bool CanLockOn ( class AActor* Target, class APawn* CasterPawn );
	void Tick ( float DeltaTime );
	void TickAimRotation ( float DeltaTime, struct FVector SeekVector );
	void TickAim ( float DeltaTime );
	struct FVector GetAimLocation ( class AActor* Target );
	void Timer ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ASFXProjectile_PowerCustomAction_SentryTurretRocket::pClassPointer = NULL;

// Class sfxgamecontent.SFXProjectile_PowerCustomAction_BouncingGrenade
// 0x0000 (0x0444 - 0x0444)
class ASFXProjectile_PowerCustomAction_BouncingGrenade : public ASFXProjectile_PowerCustomAction_Grenade
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106077 ];

		return pClassPointer;
	};

	void Explode ( struct FVector HitLocation, struct FVector HitNormal );
	void Recycle ( );
	void Bounce ( class AActor* HitActor, struct FVector HitLocation, struct FVector HitNormal );
	void Tick ( float DeltaTime );
	void ProcessTouch ( class AActor* Other, struct FVector HitLocation, struct FVector HitNormal );
	void eventHitWall ( struct FVector HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp );
	bool InitializePowerProjectile ( class AActor* oCaster, float fTravelSpeed, float fRadius, class Usfxpowercustomaction* oPower );
	void FuseDone ( );
};

UClass* ASFXProjectile_PowerCustomAction_BouncingGrenade::pClassPointer = NULL;

// Class sfxgamecontent.SFXProjectile_PowerCustomAction_SentryTurret
// 0x0000 (0x0444 - 0x0444)
class ASFXProjectile_PowerCustomAction_SentryTurret : public ASFXProjectile_PowerCustomAction_BouncingGrenade
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106078 ];

		return pClassPointer;
	};

	void Explode ( struct FVector HitLocation, struct FVector HitNormal );
	void Recycle ( );
	void Bounce ( class AActor* HitActor, struct FVector HitLocation, struct FVector HitNormal );
	void Tick ( float DeltaTime );
	void ProcessTouch ( class AActor* Other, struct FVector HitLocation, struct FVector HitNormal );
	void eventHitWall ( struct FVector HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp );
	bool InitializePowerProjectile ( class AActor* oCaster, float fTravelSpeed, float fRadius, class Usfxpowercustomaction* oPower );
	void FuseDone ( );
};

UClass* ASFXProjectile_PowerCustomAction_SentryTurret::pClassPointer = NULL;

// Class sfxgamecontent.SFXProjectile_PowerCustomAction_CombatDroneRocket
// 0x0000 (0x0465 - 0x0465)
class ASFXProjectile_PowerCustomAction_CombatDroneRocket : public Asfxprojectile_powercustomaction_seeking
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106344 ];

		return pClassPointer;
	};

	void Tick_Prediction ( float DeltaTime );
	void Recycle ( );
	void InitializeRotation ( class APawn* oCasterPawn );
	bool InitializePowerProjectile ( class AActor* oCaster, float fTravelSpeed, float fRadius, class Usfxpowercustomaction* oPower );
	void PawnEvadedPower ( class ABioPawn* Pawn, struct FName Label, float TimeBeforeImpact );
	bool CanLockOn ( class AActor* Target, class APawn* CasterPawn );
	void Tick ( float DeltaTime );
	void TickAimRotation ( float DeltaTime, struct FVector SeekVector );
	void TickAim ( float DeltaTime );
	struct FVector GetAimLocation ( class AActor* Target );
	void Timer ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ASFXProjectile_PowerCustomAction_CombatDroneRocket::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_CombatDroneBase
// 0x000F (0x06A4 - 0x0695)
class USFXPowerCustomAction_CombatDroneBase : public Usfxpowercustomaction
{
public:
	class UClass*                                      DroneClass;                                       		// 0x0698 (0x0004) [0x0000000000000000]              
	class UClass*                                      DroneAIClass;                                     		// 0x069C (0x0004) [0x0000000000000000]              
	float                                              DroneSpawnOffset;                                 		// 0x06A0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106877 ];

		return pClassPointer;
	};

	struct FVector GetBackLocation ( class AActor* Target );
	struct FVector GetFrontLocation ( class AActor* Target, float YawOffset );
	bool IsSafeSpawnLocation ( struct FVector* SpawnLocation );
	void OnDroneKilled ( class ASFXPawn_CombatDroneBase* oDrone );
	void DespawnDrone ( class ASFXPawn_CombatDroneBase* oDrone );
	void SetupSpawnedDrone ( class ASFXPawn_CombatDroneBase* SpawnedDrone );
	class ASFXPawn_CombatDroneBase* SpawnDrone ( struct FVector location, struct FRotator Rotation );
};

UClass* USFXPowerCustomAction_CombatDroneBase::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_CombatDrone
// 0x0304 (0x09A8 - 0x06A4)
class USFXPowerCustomAction_CombatDrone : public USFXPowerCustomAction_CombatDroneBase
{
public:
	struct FPowerData                                  DroneZapCooldown;                                 		// 0x06A4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  DroneShields;                                     		// 0x06D4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  DroneDamage;                                      		// 0x0704 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionDamage;                                  		// 0x0734 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionRadius;                                  		// 0x0764 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionForce;                                   		// 0x0794 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketCooldown;                                   		// 0x07C4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketDamage;                                     		// 0x07F4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketForce;                                      		// 0x0824 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketRadius;                                     		// 0x0854 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockCooldown;                                    		// 0x0884 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockDamage;                                      		// 0x08B4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockForce;                                       		// 0x08E4 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockRadius;                                      		// 0x0914 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FAreaEffectParameters                       ExplosionParameters;                              		// 0x0944 (0x0020) [0x0000000000004000]              ( CPF_Config )
	struct FVector                                     DroneDiedLocation;                                		// 0x0964 (0x000C) [0x0000000000000000]              
	int                                                Evolve_NumExtraTargets;                           		// 0x0970 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_DamageBonus;                               		// 0x0974 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ShieldBonus;                               		// 0x0978 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_DamageBonus2;                              		// 0x097C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ShieldBonus2;                              		// 0x0980 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ShieldDamageBonus;                         		// 0x0984 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class Asfxpawn_combatdrone*                        Drone;                                            		// 0x0988 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_DroneDeployed;                     		// 0x098C (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_DroneExplosionTemplate;                        		// 0x0990 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_DroneDeathTemplate;                            		// 0x0994 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 DroneExplosionSound;                              		// 0x0998 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 DroneDeathSound;                                  		// 0x099C (0x0004) [0x0000000000000000]              
	float                                              NonCombatTimeout_Length;                          		// 0x09A0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              NonCombatTimeout_UpdateFrequency;                 		// 0x09A4 (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106454 ];

		return pClassPointer;
	};

	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
	void PopulatePowerStatBarEvolves ( );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ApplyBonus ( struct FName Parameter, class USFXGameEffect* Bonus, unsigned long bRemove );
	void RecalculateAllPowerData ( unsigned long bReset );
	void EvolvePower ( unsigned char choice );
	bool OnDeathExplosionImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void OnDroneKilled ( class ASFXPawn_CombatDroneBase* oDrone );
	class UClass* GetDamageType ( );
	void OnPowerRankIncreased ( );
	bool IsDroneAlive ( );
	void SetupSpawnedDrone ( class ASFXPawn_CombatDroneBase* SpawnedDrone );
	void NonCombatDespawnDrone ( );
	void DroneNonCombatCheck ( );
	class ASFXPawn_CombatDroneBase* SpawnDrone ( struct FVector location, struct FRotator Rotation );
	void OnPowerDetonated ( struct FVector HitLocation, struct FVector HitNormal, class ASFXProjectile_PowerCustomAction* oProjectile, class AActor* HitActor );
	void StartCustomAction ( );
};

UClass* USFXPowerCustomAction_CombatDrone::pClassPointer = NULL;

// Class sfxgamecontent.SFXSeqEvt_PlaceableActivated
// 0x0000 (0x00D2 - 0x00D2)
class USFXSeqEvt_PlaceableActivated : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106593 ];

		return pClassPointer;
	};

	void eventToggled ( );
	void Reset ( );
	bool PassesWhoTriggers ( class AActor* inInstigator );
	bool CheckActivate ( class AActor* inOriginator, class AActor* inInstigator, unsigned long bTest, unsigned long bPushTop, unsigned long bSFXForceThisFrame, TArray< int >* ActivateIndices );
	void eventRegisterEvent ( );
};

UClass* USFXSeqEvt_PlaceableActivated::pClassPointer = NULL;

// Class sfxgamecontent.SFXSeqEvt_PlaceableDeactivated
// 0x0000 (0x00D2 - 0x00D2)
class USFXSeqEvt_PlaceableDeactivated : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106595 ];

		return pClassPointer;
	};

	void eventToggled ( );
	void Reset ( );
	bool PassesWhoTriggers ( class AActor* inInstigator );
	bool CheckActivate ( class AActor* inOriginator, class AActor* inInstigator, unsigned long bTest, unsigned long bPushTop, unsigned long bSFXForceThisFrame, TArray< int >* ActivateIndices );
	void eventRegisterEvent ( );
};

UClass* USFXSeqEvt_PlaceableDeactivated::pClassPointer = NULL;

// Class sfxgamecontent.SFXSeqEvt_PlaceableDestroyed
// 0x0000 (0x00D2 - 0x00D2)
class USFXSeqEvt_PlaceableDestroyed : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106621 ];

		return pClassPointer;
	};

	void eventToggled ( );
	void Reset ( );
	bool PassesWhoTriggers ( class AActor* inInstigator );
	bool CheckActivate ( class AActor* inOriginator, class AActor* inInstigator, unsigned long bTest, unsigned long bPushTop, unsigned long bSFXForceThisFrame, TArray< int >* ActivateIndices );
	void eventRegisterEvent ( );
};

UClass* USFXSeqEvt_PlaceableDestroyed::pClassPointer = NULL;

// Class sfxgamecontent.SFXSeqEvt_PlaceableReset
// 0x0000 (0x00D2 - 0x00D2)
class USFXSeqEvt_PlaceableReset : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106623 ];

		return pClassPointer;
	};

	void eventToggled ( );
	void Reset ( );
	bool PassesWhoTriggers ( class AActor* inInstigator );
	bool CheckActivate ( class AActor* inOriginator, class AActor* inInstigator, unsigned long bTest, unsigned long bPushTop, unsigned long bSFXForceThisFrame, TArray< int >* ActivateIndices );
	void eventRegisterEvent ( );
};

UClass* USFXSeqEvt_PlaceableReset::pClassPointer = NULL;

// Class sfxgamecontent.SFXPlaceable
// 0x0004 (0x0274 - 0x0270)
class ASFXPlaceable : public ASFXPlaceableBase
{
public:
	unsigned long                                      bReplicatedIsDestroyed : 1;                       		// 0x0270 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      bReplicatedIsDeactivated : 1;                     		// 0x0270 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106629 ];

		return pClassPointer;
	};

	void ActivatePlaceable ( );
	void DeactivatePlaceable ( );
	bool AllowPlaceableDamageEvents ( class AController* EventInstigator );
	bool ImpactWithPower ( unsigned char Resistance, class APawn* Caster, struct FVector HitLocation, struct FVector HitNormal, float Damage, struct FVector Force, class UClass* DamageType );
	void AreaDamage ( float Damage, float Force, class UClass* DamageType, float ImpactRadius );
	void AreaDamageForActor ( class AActor* HitActor );
	void PlaceableDestroyed ( );
	void ResetPlaceable ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ASFXPlaceable::pClassPointer = NULL;

// Class sfxgamecontent.sfxpowercustomaction_sentryturretshock
// 0x0000 (0x0695 - 0x0695)
class Usfxpowercustomaction_sentryturretshock : public Usfxpowercustomaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106641 ];

		return pClassPointer;
	};

	int GetSaveGamePowerState ( );
	void SetSaveGamePowerState ( int nState );
	struct FName GetUniquePowerPlayerVariable ( );
	void RestoreSaveState ( );
	void ReplicationDecodeDelayAndResistance ( int EncodedData, float* fDelay, unsigned char* Resistance );
	int ReplicationEncodeDelayAndResistance ( float fDelay, unsigned char Resistance );
	void OnSourcePowerBioticDetonation ( );
	struct FString GetPowerComboClassFromUniqueID ( int PowerComboTypeUniqueID );
	int GetPowerComboTypeUniqueIDFromClass ( struct FString className );
	void ClientDoPowerComboImpactFromEffect ( class AActor* oTarget, int CustomActionReactionType, struct FString EffectClassName, float DetonatorPowerRank, int MiscFlags );
	void ClientDoPowerCombo ( class UClass* EffectClass, int SourcePowerID, class ABioPawn* SourcePowerInstigator, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal );
	void ReplicatePowerCombo ( class Usfxgameeffect_powercombo* ComboEffect, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal );
	void DelayedDoPowerCombo ( );
	void DoPowerCombo ( class Usfxgameeffect_powercombo* ComboEffect, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal, unsigned long bDelayed );
	void CheckForPowerCombo ( class AActor* Target, unsigned char Resistance, struct FVector HitLocation, struct FVector HitNormal );
	class Usfxgameeffect_powercombo* AddComboEffect ( class AActor* Target, class UClass* ComboClass, float Duration );
	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
	void CombatEnded ( );
	void ReplaceAnimSetWithDynamic ( class UAnimSet* DynAnimSet );
	void GetPowerAnimInfo ( class UAnimSet** AnimSet, TArray< struct FName >* AnimNames );
	void CleanUpProjectile ( class ASFXProjectile_PowerCustomAction* oProjectile );
	void ReplicatePowerComboImpact ( class ABioPawn* Target, int CustomActionReactionType, float PowerRank, int PowerComboTypeUniqueID, int MiscFlags );
	void ReplicatePowerSubsequentImpact ( class ABioPawn* Target, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void ClientDoCustomAction ( unsigned long bForced );
	void Replicate ( );
	void PlayPowerScreenShake ( class UClass* ScreenShakeClass, struct FVector HitLocation );
	void PlayPowerControllerRumble ( class UClass* RumbleClass, struct FVector HitLocation );
	struct FVector GetDefaultClientEffectParams ( );
	void AddEvolvedRankBonus ( float Bonus, struct FPowerData* Data );
	void ApplyForceToActor ( class AActor* oActor, struct FVector vForce );
	void ApplyShieldBonus ( class ABioPawn* oPawn, float fShieldValue, unsigned long bShieldValueIsPercent, float fDuration, struct FName Category, unsigned long bRemoveEffectWhenShieldsDown );
	void ApplyHealthBonus ( class ABioPawn* oPawn, float fHealthValue, unsigned long bHealthValueIsPercent, float fDuration, struct FName Category );
	void PlayParticleSystemOnSocket ( class UParticleSystem* PS_Template, class ABioPawn* TargetPawn, struct FName SocketName, struct FRotator Rotation );
	bool HasRemainingShieldOfType ( class ABioPawn* oPawn, class UClass* ShieldClass );
	bool IsPlaceable ( class AActor* oImpacted );
	bool ApplyPermanentGameEffect ( class AActor* oTarget, class UClass* className, float fEffectValue, struct FName nmCategory, class AController* Instigator );
	bool ApplyTemporaryGameEffect ( class AActor* oTarget, class UClass* className, float fDuration, float fEffectValue, struct FName nmCategory, class AController* Instigator );
	bool IsOfRace ( class AActor* oImpacted, unsigned char eRace );
	bool CanBeRagdolledByPowers ( class ABioPawn* oPawn );
	bool ImpactPlaceable ( class AActor* oCaster, class AActor* oImpacted, struct FVector Momentum, float PlotPlaceableDamage, unsigned long bForceDamage );
	float GetPhysicsLevelResistance ( class AActor* oTarget );
	int GetPhysicsLevel ( class AActor* oImpacted, unsigned long bIgnoreResistance );
	bool IsMachineRace ( class AActor* oImpacted );
	bool ShouldUsePowerOnShields ( class ABioPawn* Target, class UClass* DamageType, struct FString* sOptionalInfo );
	void RagdollPhysicsImpact ( class APawn* oPawn, class AActor* oImpactActor, struct FVector vImpactDir );
	bool CanImpactActor ( class AActor* oActor );
	bool AddActorToImpactedList ( class AActor* oActor, struct FVector vImpactLocation, TArray< class AActor* >* ImpactedActors );
	bool DetonationHitsTarget ( struct FVector HitLocation, float MaxRange, class AActor* HitActor, struct FAreaEffectParameters DetonationParams );
	bool GetNearbyActors ( struct FVector HitLocation, float Radius, float MaxRange, struct FAreaEffectParameters Param, TArray< class AActor* >* ImpactedActors );
	void ApplyBonusToParameter ( class USFXGameEffect* Bonus, unsigned long bRemove, struct FPowerData* Parameter );
	void ApplyBonus ( struct FName Parameter, class USFXGameEffect* Bonus, unsigned long bRemove );
	void PlayImpactEffects ( class AActor* oImpacted, struct FVector ImpactLocation, struct FVector ImpactNormal );
	void PlayImpactSounds ( struct FVector ImpactLocation, class UWwiseEvent* BaseSound, TArray< struct FEvolvedSoundStruct >* EvolvedSounds );
	void PlayCasterSounds ( class UWwiseEvent* BaseSound, TArray< struct FEvolvedSoundStruct >* EvolvedSounds );
	void PlayDetonationEffects ( struct FVector ImpactLocation, struct FVector ImpactNormal, class ASFXProjectile_PowerCustomAction* oProjectile );
	void PlayReleaseEffects ( );
	bool OnImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	float GetImpactForce ( class AActor* oImpacted );
	class UClass* GetNonRagdollDamageType ( );
	float GetImpactDamage ( class AActor* oImpacted, class UClass** DamageType );
	bool DoAreaExplosionForActor ( class AActor* oActor, struct FVector location, int ImpactCount, float fDamage, class UClass* DamageType, float fForce, struct FAreaEffectParameters Param, int MaxRagdollOverride, struct FScriptDelegate ImpactCallback, class UClass* MaxRagdollDmgTypeOverride );
	void AreaExplosion ( struct FVector location, float fRadius, float fDamage, class UClass* DamageType, float fForce, struct FAreaEffectParameters Param, int MaxImpactCount, struct FScriptDelegate ImpactCallback, int MaxRagdollOverride, class UClass* MaxRagdollDmgTypeOverride );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ClientDoPowerComboImpact ( class AActor* oActor, int CustomActionReactionType, float PowerRank, int PowerComboTypeUniqueID, int MiscFlags );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	bool DoPowerDetonatedForActor ( class AActor* oActor, struct FVector HitLocation, struct FVector HitNormal, int nImpactCount, unsigned long bFirstTarget, class ASFXProjectile_PowerCustomAction* oProjectile );
	void OnPowerDetonated ( struct FVector HitLocation, struct FVector HitNormal, class ASFXProjectile_PowerCustomAction* oProjectile, class AActor* HitActor );
	void ReleaseBuffPower ( );
	void ReleaseMeleePower ( );
	void ReleaseInstantPower ( );
	void OnClientPowerProjectileSpawned ( class ASFXProjectile_PowerCustomAction* NewProjectile );
	class ASFXProjectile_PowerCustomAction* ReleaseProjectilePower ( );
	bool GetProjectileAttachPoint ( struct FVector* AttachPoint );
	void ReleasePower ( );
	void ResetPowerCooldown ( );
	void StartPowerCooldown ( );
	float GetPowerCooldown ( );
	void eventTickCustomAction ( float fDeltaTime );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void EndThisCustomAction ( );
	bool PlayBodyStance ( struct FBodyStance BodyStance, float fStanceBlendInTime, float fStanceBlendOutTime );
	void StartCastAnimations ( );
	void StartPower ( );
	void StartCustomAction ( );
	bool ChangeCoverAction ( );
	struct FBodyStance GetCurrentBodyStance ( );
	bool LoadAnimSet ( );
	bool CanUsePower ( class AActor* oTarget );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( TArray< struct FName >* UsedAnims );
};

UClass* Usfxpowercustomaction_sentryturretshock::pClassPointer = NULL;

// Class sfxgamecontent.sfxpowercustomaction_sentryturretrocket
// 0x0000 (0x0695 - 0x0695)
class Usfxpowercustomaction_sentryturretrocket : public Usfxpowercustomaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106642 ];

		return pClassPointer;
	};

	int GetSaveGamePowerState ( );
	void SetSaveGamePowerState ( int nState );
	struct FName GetUniquePowerPlayerVariable ( );
	void RestoreSaveState ( );
	void ReplicationDecodeDelayAndResistance ( int EncodedData, float* fDelay, unsigned char* Resistance );
	int ReplicationEncodeDelayAndResistance ( float fDelay, unsigned char Resistance );
	void OnSourcePowerBioticDetonation ( );
	struct FString GetPowerComboClassFromUniqueID ( int PowerComboTypeUniqueID );
	int GetPowerComboTypeUniqueIDFromClass ( struct FString className );
	void ClientDoPowerComboImpactFromEffect ( class AActor* oTarget, int CustomActionReactionType, struct FString EffectClassName, float DetonatorPowerRank, int MiscFlags );
	void ClientDoPowerCombo ( class UClass* EffectClass, int SourcePowerID, class ABioPawn* SourcePowerInstigator, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal );
	void ReplicatePowerCombo ( class Usfxgameeffect_powercombo* ComboEffect, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal );
	void DelayedDoPowerCombo ( );
	void DoPowerCombo ( class Usfxgameeffect_powercombo* ComboEffect, class ABioPawn* TargetPawn, struct FVector HitLocation, struct FVector HitNormal, unsigned long bDelayed );
	void CheckForPowerCombo ( class AActor* Target, unsigned char Resistance, struct FVector HitLocation, struct FVector HitNormal );
	class Usfxgameeffect_powercombo* AddComboEffect ( class AActor* Target, class UClass* ComboClass, float Duration );
	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
	void CombatEnded ( );
	void ReplaceAnimSetWithDynamic ( class UAnimSet* DynAnimSet );
	void GetPowerAnimInfo ( class UAnimSet** AnimSet, TArray< struct FName >* AnimNames );
	void CleanUpProjectile ( class ASFXProjectile_PowerCustomAction* oProjectile );
	void ReplicatePowerComboImpact ( class ABioPawn* Target, int CustomActionReactionType, float PowerRank, int PowerComboTypeUniqueID, int MiscFlags );
	void ReplicatePowerSubsequentImpact ( class ABioPawn* Target, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void ClientDoCustomAction ( unsigned long bForced );
	void Replicate ( );
	void PlayPowerScreenShake ( class UClass* ScreenShakeClass, struct FVector HitLocation );
	void PlayPowerControllerRumble ( class UClass* RumbleClass, struct FVector HitLocation );
	struct FVector GetDefaultClientEffectParams ( );
	void AddEvolvedRankBonus ( float Bonus, struct FPowerData* Data );
	void ApplyForceToActor ( class AActor* oActor, struct FVector vForce );
	void ApplyShieldBonus ( class ABioPawn* oPawn, float fShieldValue, unsigned long bShieldValueIsPercent, float fDuration, struct FName Category, unsigned long bRemoveEffectWhenShieldsDown );
	void ApplyHealthBonus ( class ABioPawn* oPawn, float fHealthValue, unsigned long bHealthValueIsPercent, float fDuration, struct FName Category );
	void PlayParticleSystemOnSocket ( class UParticleSystem* PS_Template, class ABioPawn* TargetPawn, struct FName SocketName, struct FRotator Rotation );
	bool HasRemainingShieldOfType ( class ABioPawn* oPawn, class UClass* ShieldClass );
	bool IsPlaceable ( class AActor* oImpacted );
	bool ApplyPermanentGameEffect ( class AActor* oTarget, class UClass* className, float fEffectValue, struct FName nmCategory, class AController* Instigator );
	bool ApplyTemporaryGameEffect ( class AActor* oTarget, class UClass* className, float fDuration, float fEffectValue, struct FName nmCategory, class AController* Instigator );
	bool IsOfRace ( class AActor* oImpacted, unsigned char eRace );
	bool CanBeRagdolledByPowers ( class ABioPawn* oPawn );
	bool ImpactPlaceable ( class AActor* oCaster, class AActor* oImpacted, struct FVector Momentum, float PlotPlaceableDamage, unsigned long bForceDamage );
	float GetPhysicsLevelResistance ( class AActor* oTarget );
	int GetPhysicsLevel ( class AActor* oImpacted, unsigned long bIgnoreResistance );
	bool IsMachineRace ( class AActor* oImpacted );
	bool ShouldUsePowerOnShields ( class ABioPawn* Target, class UClass* DamageType, struct FString* sOptionalInfo );
	void RagdollPhysicsImpact ( class APawn* oPawn, class AActor* oImpactActor, struct FVector vImpactDir );
	bool CanImpactActor ( class AActor* oActor );
	bool AddActorToImpactedList ( class AActor* oActor, struct FVector vImpactLocation, TArray< class AActor* >* ImpactedActors );
	bool DetonationHitsTarget ( struct FVector HitLocation, float MaxRange, class AActor* HitActor, struct FAreaEffectParameters DetonationParams );
	bool GetNearbyActors ( struct FVector HitLocation, float Radius, float MaxRange, struct FAreaEffectParameters Param, TArray< class AActor* >* ImpactedActors );
	void ApplyBonusToParameter ( class USFXGameEffect* Bonus, unsigned long bRemove, struct FPowerData* Parameter );
	void ApplyBonus ( struct FName Parameter, class USFXGameEffect* Bonus, unsigned long bRemove );
	void PlayImpactEffects ( class AActor* oImpacted, struct FVector ImpactLocation, struct FVector ImpactNormal );
	void PlayImpactSounds ( struct FVector ImpactLocation, class UWwiseEvent* BaseSound, TArray< struct FEvolvedSoundStruct >* EvolvedSounds );
	void PlayCasterSounds ( class UWwiseEvent* BaseSound, TArray< struct FEvolvedSoundStruct >* EvolvedSounds );
	void PlayDetonationEffects ( struct FVector ImpactLocation, struct FVector ImpactNormal, class ASFXProjectile_PowerCustomAction* oProjectile );
	void PlayReleaseEffects ( );
	bool OnImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	float GetImpactForce ( class AActor* oImpacted );
	class UClass* GetNonRagdollDamageType ( );
	float GetImpactDamage ( class AActor* oImpacted, class UClass** DamageType );
	bool DoAreaExplosionForActor ( class AActor* oActor, struct FVector location, int ImpactCount, float fDamage, class UClass* DamageType, float fForce, struct FAreaEffectParameters Param, int MaxRagdollOverride, struct FScriptDelegate ImpactCallback, class UClass* MaxRagdollDmgTypeOverride );
	void AreaExplosion ( struct FVector location, float fRadius, float fDamage, class UClass* DamageType, float fForce, struct FAreaEffectParameters Param, int MaxImpactCount, struct FScriptDelegate ImpactCallback, int MaxRagdollOverride, class UClass* MaxRagdollDmgTypeOverride );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ClientDoPowerComboImpact ( class AActor* oActor, int CustomActionReactionType, float PowerRank, int PowerComboTypeUniqueID, int MiscFlags );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	bool DoPowerDetonatedForActor ( class AActor* oActor, struct FVector HitLocation, struct FVector HitNormal, int nImpactCount, unsigned long bFirstTarget, class ASFXProjectile_PowerCustomAction* oProjectile );
	void OnPowerDetonated ( struct FVector HitLocation, struct FVector HitNormal, class ASFXProjectile_PowerCustomAction* oProjectile, class AActor* HitActor );
	void ReleaseBuffPower ( );
	void ReleaseMeleePower ( );
	void ReleaseInstantPower ( );
	void OnClientPowerProjectileSpawned ( class ASFXProjectile_PowerCustomAction* NewProjectile );
	class ASFXProjectile_PowerCustomAction* ReleaseProjectilePower ( );
	bool GetProjectileAttachPoint ( struct FVector* AttachPoint );
	void ReleasePower ( );
	void ResetPowerCooldown ( );
	void StartPowerCooldown ( );
	float GetPowerCooldown ( );
	void eventTickCustomAction ( float fDeltaTime );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void EndThisCustomAction ( );
	bool PlayBodyStance ( struct FBodyStance BodyStance, float fStanceBlendInTime, float fStanceBlendOutTime );
	void StartCastAnimations ( );
	void StartPower ( );
	void StartCustomAction ( );
	bool ChangeCoverAction ( );
	struct FBodyStance GetCurrentBodyStance ( );
	bool LoadAnimSet ( );
	bool CanUsePower ( class AActor* oTarget );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( TArray< struct FName >* UsedAnims );
};

UClass* Usfxpowercustomaction_sentryturretrocket::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_AmmoPower
// 0x0057 (0x06EC - 0x0695)
class USFXPowerCustomAction_AmmoPower : public USFXPowerCustomAction_AmmoPowerBase
{
public:
	class UClass*                                      WeaponPowerEffectClass;                           		// 0x0698 (0x0004) [0x0000000000000000]              
	class UClass*                                      ConcussiveShotDamageType;                         		// 0x069C (0x0004) [0x0000000000000000]              
	struct FGuid                                       OmniToolGuid;                                     		// 0x06A0 (0x0010) [0x0000000000000000]              
	class UStaticMesh*                                 oTracer;                                          		// 0x06B0 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             oImpactVFX;                                       		// 0x06B4 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             oMuzzleVFX;                                       		// 0x06B8 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             oMuzzleLoopVFX;                                   		// 0x06BC (0x0004) [0x0000000000000000]              
	float                                              SquadEffectiveness;                               		// 0x06C0 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_HeavyWeaponEquipped;               		// 0x06C4 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_ConcussiveShotImpact;                          		// 0x06C8 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_ConcussiveShotProjectile;                      		// 0x06CC (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 ConcussiveShotImpactSound;                        		// 0x06D0 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 LoadAmmoPowerSound;                               		// 0x06D4 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 HenchmanLoadAmmoPowerSound;                       		// 0x06D8 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_OmniTool;                                      		// 0x06DC (0x0004) [0x0000000000000000]              
	float                                              OmniToolDuration;                                 		// 0x06E0 (0x0004) [0x0000000000000000]              
	class ABioPawn*                                    DelayedSetWeaponPowerTarget;                      		// 0x06E4 (0x0004) [0x0000000000000000]              
	unsigned long                                      bModifyTracer : 1;                                		// 0x06E8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bModifyImpactVFX : 1;                             		// 0x06E8 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bModifyMuzzle : 1;                                		// 0x06E8 (0x0004) [0x0000000000000000] [0x00000004] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 107316 ];

		return pClassPointer;
	};

	void DelayedSetWeaponPower ( );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void DoJoinInProgress ( );
	void SetupEffect ( class USFXGameEffect_AmmoPower* Effect, class ABioPawn* oPawn );
	void OnPowerRankIncreased ( );
	bool ShouldUsePower ( class AActor* Target, struct FString* sOptionalInfo );
	void DoConcussiveShotSpecialImpact ( class AActor* oImpacted, float ImpactEffectDuration );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ReplicateConcussiveShotSpecialImpact ( class ABioPawn* oImpacted, float DurationOfEffect );
	void ConcussiveShotCustomImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ApplyPowerEffects ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon );
	bool SetWeaponPower ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon, unsigned long bOverrideCurrentPower );
	void DeferedSetWeaponPower ( );
	bool OnImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ReloadAmmoPower ( class ABioPawn* Target, class ASFXWeapon* Weapon );
	void StopOmniTool ( );
	void StartCustomAction ( );
	bool CanUsePower ( class AActor* oTarget );
	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
};

UClass* USFXPowerCustomAction_AmmoPower::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_SentryTurretArmorPiercingAmmo
// 0x0000 (0x06EC - 0x06EC)
class USFXPowerCustomAction_SentryTurretArmorPiercingAmmo : public USFXPowerCustomAction_AmmoPower
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106643 ];

		return pClassPointer;
	};

	void DelayedSetWeaponPower ( );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void DoJoinInProgress ( );
	void SetupEffect ( class USFXGameEffect_AmmoPower* Effect, class ABioPawn* oPawn );
	void OnPowerRankIncreased ( );
	bool ShouldUsePower ( class AActor* Target, struct FString* sOptionalInfo );
	void DoConcussiveShotSpecialImpact ( class AActor* oImpacted, float ImpactEffectDuration );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ReplicateConcussiveShotSpecialImpact ( class ABioPawn* oImpacted, float DurationOfEffect );
	void ConcussiveShotCustomImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ApplyPowerEffects ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon );
	bool SetWeaponPower ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon, unsigned long bOverrideCurrentPower );
	void DeferedSetWeaponPower ( );
	bool OnImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ReloadAmmoPower ( class ABioPawn* Target, class ASFXWeapon* Weapon );
	void StopOmniTool ( );
	void StartCustomAction ( );
	bool CanUsePower ( class AActor* oTarget );
	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
};

UClass* USFXPowerCustomAction_SentryTurretArmorPiercingAmmo::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_SentryTurretCryoAmmo
// 0x0004 (0x06F0 - 0x06EC)
class USFXPowerCustomAction_SentryTurretCryoAmmo : public USFXPowerCustomAction_AmmoPower
{
public:
	float                                              FreezeChance;                                     		// 0x06EC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106644 ];

		return pClassPointer;
	};

	bool eventShouldUsePower ( class AActor* Target, struct FString* sOptionalInfo );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void SetupEffect ( class USFXGameEffect_AmmoPower* Effect, class ABioPawn* oPawn );
	void ApplyPowerEffects ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon );
};

UClass* USFXPowerCustomAction_SentryTurretCryoAmmo::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_SentryTurret
// 0x0297 (0x092C - 0x0695)
class USFXPowerCustomAction_SentryTurret : public Usfxpowercustomaction
{
public:
	struct FPowerData                                  TurretShields;                                    		// 0x0698 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketCooldown;                                   		// 0x06C8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketDamage;                                     		// 0x06F8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketForce;                                      		// 0x0728 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  RocketRadius;                                     		// 0x0758 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  FlamethrowerDamagePerSec;                         		// 0x0788 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  FlamethrowerDamageDuration;                       		// 0x07B8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  FreezeDuration;                                   		// 0x07E8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockCooldown;                                    		// 0x0818 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockDamage;                                      		// 0x0848 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockForce;                                       		// 0x0878 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockRadius;                                      		// 0x08A8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FGuid                                       TurretBaseGuid;                                   		// 0x08D8 (0x0010) [0x0000000000000000]              
	struct FVector                                     SpawnLocation;                                    		// 0x08E8 (0x000C) [0x0000000000000000]              
	float                                              Evolve_CryoFreezeChance;                          		// 0x08F4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ArmorPiercingDamage;                       		// 0x08F8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ShieldBonus;                               		// 0x08FC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_DamageBonus;                               		// 0x0900 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class Asfxpawn_sentryturret*                       Turret;                                           		// 0x0904 (0x0004) [0x0000000000000000]              
	void*                                              NotRecommended_TurretDeployed;                    		// 0x0908 (0x0004) [0x0000000000000000]              
	float                                              SpawnDelay;                                       		// 0x090C (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_TurretBase;                                    		// 0x0910 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_ShutdownEffect;                                		// 0x0914 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_DeathEffect;                                   		// 0x0918 (0x0004) [0x0000000000000000]              
	float                                              SpawnZOffset;                                     		// 0x091C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              NonCombatTimeout_Length;                          		// 0x0920 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              NonCombatTimeout_UpdateFrequency;                 		// 0x0924 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      DeathByShutdown : 1;                              		// 0x0928 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106684 ];

		return pClassPointer;
	};

	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
	void PopulatePowerStatBarEvolves ( );
	void ApplyBonus ( struct FName Parameter, class USFXGameEffect* Bonus, unsigned long bRemove );
	void RecalculateAllPowerData ( unsigned long bReset );
	void EvolvePower ( unsigned char choice );
	bool eventShouldUsePower ( class AActor* Target, struct FString* sOptionalInfo );
	void OnTurretKilled ( class Asfxpawn_sentryturret* oTurret );
	void DespawnTurret ( class Asfxpawn_sentryturret* oTurret );
	void OnPowerRankIncreased ( );
	bool IsTurretAlive ( );
	void SetupCurrentTurret ( );
	void NonCombatDespawnTurret ( );
	void TurretNonCombatCheck ( );
	class Asfxpawn_sentryturret* SpawnTurret ( struct FVector location, struct FRotator Rotation );
	void DelayedSpawn ( );
	void OnPowerDetonated ( struct FVector HitLocation, struct FVector HitNormal, class ASFXProjectile_PowerCustomAction* oProjectile, class AActor* HitActor );
	void StartCustomAction ( );
};

UClass* USFXPowerCustomAction_SentryTurret::pClassPointer = NULL;

// Class sfxgamecontent.sfxpawn_sentryturret
// 0x0058 (0x0D98 - 0x0D40)
class Asfxpawn_sentryturret : public Asfxpawn
{
public:
	struct FScriptDelegate                             __OnTurretKilled__Delegate;                       		// 0x0D40 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FGuid                                       TurretVFXGuid;                                    		// 0x0D4C (0x0010) [0x0000000000000000]              
	struct FGuid                                       TurretBaseVFXGuid;                                		// 0x0D5C (0x0010) [0x0000000000000000]              
	struct FReplicatedTurretCreator                    ReplicatedTurretCreatorInfo;                      		// 0x0D6C (0x0008) [0x0000000000000020]              ( CPF_Net )
	class URvrClientEffectInterface*                   CE_TurretTemplate;                                		// 0x0D74 (0x0004) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_PlayerTurretTemplate;                          		// 0x0D78 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   MIC_TurretHealth;                                 		// 0x0D7C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UWwiseEvent*                                 SpawnSound;                                       		// 0x0D80 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 DiedSound;                                        		// 0x0D84 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 LoopingSound;                                     		// 0x0D88 (0x0004) [0x0000000000000000]              
	class UWwiseEvent*                                 StopLoopingSound;                                 		// 0x0D8C (0x0004) [0x0000000000000000]              
	class AActor*                                      Caster;                                           		// 0x0D90 (0x0004) [0x0000000000000000]              
	unsigned long                                      bLoopSoundActive : 1;                             		// 0x0D94 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHasShock : 1;                                    		// 0x0D94 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bIsClientSideInitialized : 1;                     		// 0x0D94 (0x0004) [0x0000000000000000] [0x00000004] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 106711 ];

		return pClassPointer;
	};

	class AActor* GetPetOwner ( );
	void PlayDeathVocalization ( class ABioPawn* Killer );
	void PlayDying ( class UClass* DamageType, struct FVector HitLoc );
	void TakeDamage ( float DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void TurretCreatorInfoUpdated ( );
	void eventReplicatedEvent ( struct FName VarName );
	void StartVFX ( );
	void SetupCasterAndReplication ( class AActor* NewCaster, int CasterPowerCustomAction );
	void PostBeginPlay ( );
	void OnTurretKilled ( class Asfxpawn_sentryturret* oTurret );
};

UClass* Asfxpawn_sentryturret::pClassPointer = NULL;

// Class sfxgamecontent.SFXPowerCustomAction_Decoy
// 0x020B (0x08A0 - 0x0695)
class USFXPowerCustomAction_Decoy : public Usfxpowercustomaction
{
public:
	struct FPowerData                                  DecoyShields;                                     		// 0x0698 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionDamage;                                  		// 0x06C8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionForce;                                   		// 0x06F8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ExplosionRadius;                                  		// 0x0728 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockDamage;                                      		// 0x0758 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockForce;                                       		// 0x0788 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ShockRadius;                                      		// 0x07B8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  DecoyDamageProtection;                            		// 0x07E8 (0x0030) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
