/*
#############################################################################################
# Mass Effect 3 (1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: WwiseAudio_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Engine.ActorFactory.PostCreateActor
// [0x00020900] ( FUNC_Event )
struct UActorFactoryWwiseAmbientSound_eventPostCreateActor_Parms
{
	class AActor*                                      NewActor;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function WwiseAudio.SeqAct_WwiseMusicVolumeDisable.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct USeqAct_WwiseMusicVolumeDisable_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.SeqAct_WwiseMusicVolumeEnable.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct USeqAct_WwiseMusicVolumeEnable_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.SeqAct_WwisePostEvent.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct USeqAct_WwisePostEvent_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAmbientSound.HideEmitter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseAmbientSound_execHideEmitter_Parms
{
};

// Function WwiseAudio.WwiseAmbientSound.DrawEmitter
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseAmbientSound_execDrawEmitter_Parms
{
};

// Function WwiseAudio.WwiseAudioComponent.SetLocation
// [0x00020103] ( FUNC_Final )
struct UWwiseAudioComponent_execSetLocation_Parms
{
	struct FVector                                     NewLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function WwiseAudio.WwiseAudioComponent.SetDrawMic
// [0x00022400] ( FUNC_Native )
struct UWwiseAudioComponent_execSetDrawMic_Parms
{
	unsigned long                                      bDraw : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function WwiseAudio.WwiseAudioComponent.KillSound
// [0x00020400] ( FUNC_Native )
struct UWwiseAudioComponent_execKillSound_Parms
{
	class UWwiseEvent*                                 Event;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.Set3D
// [0x00020400] ( FUNC_Native )
struct UWwiseAudioComponent_execSet3D_Parms
{
};

// Function WwiseAudio.WwiseAudioComponent.Set2D
// [0x00020400] ( FUNC_Native )
struct UWwiseAudioComponent_execSet2D_Parms
{
};

// Function WwiseAudio.WwiseAudioComponent.RegisterGameObject
// [0x00024400] ( FUNC_Native )
struct UWwiseAudioComponent_execRegisterGameObject_Parms
{
	struct FString                                     GameObjectName;                                   		// 0x0000 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.UnregisterGameObject
// [0x00020400] ( FUNC_Native )
struct UWwiseAudioComponent_execUnregisterGameObject_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.GetDistanceToListener
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execGetDistanceToListener_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetObstructionOcclusionEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetObstructionOcclusionEnabled_Parms
{
	unsigned long                                      i_bValue : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function WwiseAudio.WwiseAudioComponent.SetEnvironmentalAudioEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetEnvironmentalAudioEnabled_Parms
{
	unsigned long                                      i_bValue : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function WwiseAudio.WwiseAudioComponent.GetObstructionOcclusionEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execGetObstructionOcclusionEnabled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.GetEnvironmentalAudioEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execGetEnvironmentalAudioEnabled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.GetMicPosition
// [0x00022400] ( FUNC_Native )
struct UWwiseAudioComponent_execGetMicPosition_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetGlobalRTPCFromScript
// [0x00022400] ( FUNC_Native )
struct UWwiseAudioComponent_execSetGlobalRTPCFromScript_Parms
{
	struct FString                                     in_pszRtpcName;                                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              in_value;                                         		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.StaticPostGlobalEventFromScript
// [0x00022400] ( FUNC_Native )
struct UWwiseAudioComponent_execStaticPostGlobalEventFromScript_Parms
{
	struct FName                                       GlobalEventName;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.CreateComponentFromScript
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execCreateComponentFromScript_Parms
{
	class AActor*                                      pActor;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Label;                                            		// 0x0004 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FName                                       ComponentGroup;                                   		// 0x0010 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachBone;                                       		// 0x0018 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRegister : 1;                                    		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	class UWwiseAudioComponent*                        ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
};

// Function WwiseAudio.WwiseAudioComponent.IsEventPlaying
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execIsEventPlaying_Parms
{
	int                                                WwisePlayingID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.IsPlaying
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execIsPlaying_Parms
{
	class UWwiseBaseSoundObject*                       Event;                                            		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.PostGlobalEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execPostGlobalEvent_Parms
{
	struct FName                                       GlobalEventName;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetWwiseTrigger
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetWwiseTrigger_Parms
{
	struct FString                                     sTrigger;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetWwiseSwitch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetWwiseSwitch_Parms
{
	struct FString                                     sGroup;                                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sState;                                           		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetWwiseRTPCs
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetWwiseRTPCs_Parms
{
	TArray< struct FString >                           sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< float >                                    fValue;                                           		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetWwiseRTPC
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetWwiseRTPC_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              fValue;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.Stop
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execStop_Parms
{
	class UWwiseBaseSoundObject*                       Base;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.StopWwiseEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execStopWwiseEvent_Parms
{
	struct FWwiseEventPair                             AudioEvent;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.Play
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execPlay_Parms
{
	class UWwiseBaseSoundObject*                       Base;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTrackPosition : 1;                               		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.PlayWwiseEvent
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execPlayWwiseEvent_Parms
{
	struct FWwiseEventPair                             AudioEvent;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTrackPosition : 1;                               		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SoundPositionByID
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSoundPositionByID_Parms
{
	int                                                WwisePlayingID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SoundPosition
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSoundPosition_Parms
{
	class UWwiseBaseSoundObject*                       Base;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.StopAll
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execStopAll_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.FindPlayingID
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execFindPlayingID_Parms
{
	class UWwiseBaseSoundObject*                       BaseSound;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UWwiseEvent*                                 StopEvent;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function WwiseAudio.WwiseAudioComponent.SetRTPCWithHandler
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioComponent_execSetRTPCWithHandler_Parms
{
	struct FWwiseRTPCForActorHandler                   RTPCHandler;                                      		// 0x0000 (0x0014) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	float                                              fValue;                                           		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function WwiseAudio.WwiseAudioComponentMultiLoc.Set3D
// [0x00020400] ( FUNC_Native )
struct UWwiseAudioComponentMultiLoc_execSet3D_Parms
{
};

// Function Engine.AudioDevice.SetSoundMode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UWwiseAudioDevice_execSetSoundMode_Parms
{
	struct FName                                       NewMode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.LocalToWorld
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execLocalToWorld_Parms
{
	struct FVector                                     vLocal;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.BioBaseRemovedFromWorld
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventBioBaseRemovedFromWorld_Parms
{
};

// Function Engine.Actor.BioRestoreFromStasis
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execBioRestoreFromStasis_Parms
{
};

// Function Engine.Actor.BioApplyStasis
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execBioApplyStasis_Parms
{
	struct FString                                     Cause;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function Engine.Actor.PlayFootStepSound
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPlayFootStepSound_Parms
{
	int                                                FootDown;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SFXSetAudioComponentRTPCs
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventSFXSetAudioComponentRTPCs_Parms
{
	class UActorComponent*                             pWwiseAudioComponent;                             		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.GetHeadSkelMeshComponent
// [0x00020400] ( FUNC_Native )
struct AWwiseMicPosOrient_execGetHeadSkelMeshComponent_Parms
{
	class USkeletalMeshComponent*                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
};

// Function Engine.Actor.GetPrimarySkelMeshComponent
// [0x00020400] ( FUNC_Native )
struct AWwiseMicPosOrient_execGetPrimarySkelMeshComponent_Parms
{
	class USkeletalMeshComponent*                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
};

// Function Engine.Actor.ImpactWithPower
// [0x00020100] 
struct AWwiseMicPosOrient_execImpactWithPower_Parms
{
	unsigned char                                      Resistance;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       Caster;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              Damage;                                           		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Force;                                            		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0034 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetPowerResistance
// [0x00420102] 
struct AWwiseMicPosOrient_execGetPowerResistance_Parms
{
	class APawn*                                       Caster;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              Damage;                                           		// 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Force;                                            		// 0x0020 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UClass*                                      DamageType;                                       		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      TargetOverride;                                   		// 0x0030 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned char                                      ReturnValue;                                      		// 0x0034 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.RemoveSFXModuleIndex
// [0x00020400] ( FUNC_Native )
struct AWwiseMicPosOrient_execRemoveSFXModuleIndex_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.RemoveSFXModule
// [0x00020400] ( FUNC_Native )
struct AWwiseMicPosOrient_execRemoveSFXModule_Parms
{
	class USFXModule*                                  oModule;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.AddSFXModule
// [0x00024400] ( FUNC_Native )
struct AWwiseMicPosOrient_execAddSFXModule_Parms
{
	class USFXModule*                                  oModule;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUserModule : 1;                                  		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function Engine.Actor.StopAllSounds
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execStopAllSounds_Parms
{
};

// Function Engine.Actor.WillOverlap
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execWillOverlap_Parms
{
	struct FVector                                     PosA;                                             		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelA;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     PosB;                                             		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelB;                                             		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Radius;                                           		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Time;                                             		// 0x0038 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x003C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetAvoidanceVector
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execGetAvoidanceVector_Parms
{
	TArray< class AActor* >                            Obstacles;                                        		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FVector                                     GoalLocation;                                     		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              CollisionRadius;                                  		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              MaxSpeed;                                         		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumSamples;                                       		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              VelocityStepRate;                                 		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              MaxTimeTilOverlap;                                		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x002C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsClient
// [0x00020103] ( FUNC_Final )
struct AWwiseMicPosOrient_execIsClient_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsServer
// [0x00020103] ( FUNC_Final )
struct AWwiseMicPosOrient_execIsServer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsOwningClient
// [0x00020102] 
struct AWwiseMicPosOrient_execIsOwningClient_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventReplicationEnded_Parms
{
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPostDemoRewind_Parms
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventAnimTreeUpdated_Parms
{
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execSupportsKismetModification_Parms
{
	class USequenceOp*                                 AskingOp;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Reason;                                           		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventTrailsNotifyEnd_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventTrailsNotifyTick_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventTrailsNotify_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPlayParticleEffect_Parms
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.GetAimAdhesionExtent
// [0x00420102] 
struct AWwiseMicPosOrient_execGetAimAdhesionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Center;                                           		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.GetAimFrictionExtent
// [0x00420102] 
struct AWwiseMicPosOrient_execGetAimFrictionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Center;                                           		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execIsInPersistentLevel_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.SetActive
// [0x00020400] ( FUNC_Native )
struct AWwiseMicPosOrient_execSetActive_Parms
{
	unsigned long                                      bActive : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.GetModule
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execGetModule_Parms
{
	class UClass*                                      ModuleClass;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USFXModule*                                  ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm )
};

// Function Engine.Actor.ExceededPhysicsThreshold
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventExceededPhysicsThreshold_Parms
{
	class AActor*                                      instigatedBy;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventOnRigidBodySpringOverextension_Parms
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execGetPackageGuid_Parms
{
	struct FName                                       PackageName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FGuid                                       ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventRootMotionExtracted_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         		// 0x0010 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventRootMotionModeChanged_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AWwiseMicPosOrient_execNativePostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AWwiseMicPosOrient_execSetHUDLocation_Parms
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnRanOver
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventOnRanOver_Parms
{
	class ASVehicle*                                   Vehicle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	int                                                WheelIndex;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventInterpolationChanged_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventInterpolationFinished_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] ( FUNC_Event )
struct AWwiseMicPosOrient_eventInterpolationStarted_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UInterpGroupInst*                            GroupInst;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.PickedUpBy
// [0x00020000] 
struct AWwiseMicPosOrient_execPickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventSpawnedByKismet_Parms
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500] ( FUNC_Native )
struct AWwiseMicPosOrient_execGetTargetLocation_Parms
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRequestAlternateLoc : 1;                         		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102] 
struct AWwiseMicPosOrient_execFindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    GoodRotation;                                     		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100] 
struct AWwiseMicPosOrient_execNotifyLocalPlayerTeamReceived_Parms
{
};

// Function Engine.Actor.GetLocationStringFor
// [0x00020102] 
struct AWwiseMicPosOrient_execGetLocationStringFor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] ( FUNC_Event )
struct AWwiseMicPosOrient_eventScriptGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AWwiseMicPosOrient_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000] 
struct AWwiseMicPosOrient_execPawnBaseDied_Parms
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500] ( FUNC_Native )
struct AWwiseMicPosOrient_execIsPlayerOwned_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420902] ( FUNC_Event )
struct AWwiseMicPosOrient_eventGetActorEyesViewPoint_Parms
{
	struct FVector                                     out_Location;                                     		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_rotation;                                     		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.IsStationary
// [0x00020002] 
struct AWwiseMicPosOrient_execIsStationary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventGetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102] 
struct AWwiseMicPosOrient_execCanActorPlayFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102] 
struct AWwiseMicPosOrient_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventSetSkelControlScale_Parms
{
	struct FName                                       SkelControlName;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Scale;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventSetMorphWeight_Parms
{
	struct FName                                       MorphNodeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventStopActorFaceFXAnim_Parms
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventPlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     GroupName;                                        		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     SeqName;                                          		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class USoundCue*                                   SoundCueToPlay;                                   		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FinishMovementControl
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventFinishMovementControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.BeginMovementControl
// [0x00020802] ( FUNC_Event )
struct AWwiseMicPosOrient_eventBeginMovementControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventFinishAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventSetAnimPosition_Parms
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       InAnimSeqName;                                    		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFireNotifies : 1;                                		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bLooping : 1;                                     		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventBeginAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimPlay
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventOnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimEnd
// [0x00020800] ( FUNC_Event )
struct AWwiseMicPosOrient_eventOnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.DoKismetAttachment
// [0x00020002] 
struct AWwiseMicPosOrient_execDoKismetAttachment_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bOldCollideActors : 1;                            		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bOldBlockActors : 1;                              		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  X;                                                		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x0028 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.OnAttachToActor
// [0x00020002] 
struct AWwiseMicPosOrient_execOnAttachToActor_Parms
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Attachment;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// TArray< class UObject* >                        objVars;                                          		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function Engine.Actor.BioEnqueueDoKismetAttachment
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AWwiseMicPosOrient_execBioEnqueueDoKismetAttachment_Parms
{
	class AActor*                                      InAttachment;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInDetach : 1;                                    		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bInHardAttach : 1;                                		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FName                                       InBoneName;                                       		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeOffset : 1;                         		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FVector                                     InRelativeOffset;                                 		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeRotation : 1;                       		// 0x0024 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FRotator                                    InRelativeRotation;                               		// 0x0028 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.BioDoKismetAttachment
// [0x00020802] ( FUNC_Event )
struct AWwiseMicPosOrient_eventBioDoKismetAttachment_Parms
{
	class AActor*                                      InAttachment;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInDetach : 1;                                    		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bInHardAttach : 1;                                		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FName                                       InBoneName;                                       		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeOffset : 1;                         		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FVector                                     InRelativeOffset;                                 		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeRotation : 1;                       		// 0x0024 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FRotator                                    InRelativeRotation;                               		// 0x0028 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class USeqAct_AttachToActor*                    Seq;                                              		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102] 
struct AWwiseMicPosOrient_execOnToggleHidden_Parms
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AttachIdx;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnChangeCollision
// [0x00020002] 
struct AWwiseMicPosOrient_execOnChangeCollision_Parms
{
